{	
	"id" : "/post/xamarin-android-vs-traditional-java/",
	"tv" : false,
	"date": "2016-05-09 16:00:00 -0500",
	"title" : "Xamarin.Android vs Android tradicional (con Java)",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//xamarin-android/java-c-sharp.png",
	"tags" :
	["VisualStudio","Xamarin"],
	
	"content" : body"Al igual que  <a href=\"../xamarin-ios-vs-traditional\">como lo hice con iOS</a>\t, en este post te mostraré algunas de las diferencias y similitudes entre el desarrollo con Java y C# para Android. Para este post cree una app que compara dos cadenas y calcula su <a href=\"https://es.wikipedia.org/wiki/Distancia_de_Levenshtein\" target=\"_blank\" rel=\"nofollow\">distancia</a> entre ellas, hice dos versiones una tradicional y una con Xamarin.Android. Esta es la app finalizada:\n \n{% post_image app.gif \"App terminada\" %}\n \n Yo incursioné por primera vez en el desarrollo móvil tomando un pequeño curso de Android y no mucho ha cambiado desde entonces, para este post usé\n\n### Estructura del proyecto\n{% post_image comparison.png \"Comparison project structure\" %}\n\n<ol>\n\t<li><b>Proyecto móvil</b>. El concepto de proyecto es el mismo, en ambos casos el un proyecto se refiere a una sola aplicación.</li>\n   \t<li><b>AndroidManifest.xml</b>. Este archivo en el que se define gran parte de la configuración del proyecto se mantiene idéntico en ambas opciones de desarrollo. Sin embargo, cuando usamos Xamarin podemos trasladar parte de esta configuración al código, pero más adelante hablaré de eso.</li>\n  \t<li><b>Recursos</b>. Los recursos se siguen organizando de la misma manera (en carpetas dependiendo de su resolución/tamaño), solo que mientras que usando Xamarin la carpeta se llama <code>Resources</code>, en el tradicional se llama <code>res</code>.</li>\n   \t<li><b>Layouts</b>. En el caso de esta app, tanto el archivo <code>Main.axml</code> como el <code>activity_main.xml</code> tienen más o menos el mismo contenido y de hecho son compatibles entre ellos. La diferencia en las extensiones es para que Visual Studio lo reconozca como un archivo de interfaz gráfica para Android y pueda dar usando Intellisense.</li>\n   \t<li><b>Drawables por resolución</b>. A diferencia de iOS, en donde se distingue un recurso de otro mediante los sufijos `@x</code>, en Android estos deben ir en carpetas separadas totalmente, y en Xamarin no es la excepción.</li>  \n   \t<li><b>Drawables en xml</b>. En este caso el archivo <code>empty_divider.xml</code> tiene el mismo contenido, para esta app el archivo contiene un divisor transparente para el <code>StackView</code>.</li>  \n   \t<li><b>Recursos en xml</b>. Cualquier recurso como <code>strings</code>, <code>colors</code>, <code>values</code> es empleado de la misma manera.</li>  \n   \t<li><b>Biblioteca de lógica externa</b>. En ambos casos la lógica de nuestra aplicación puede ser separada en un proyecto externo, en ambos casos, una librería. Cabe mencionar que usando C# creamos una biblioteca de clases portable y compartir este código con apps de iOS u otras plataformas.</li>\n   \t<li><b>Código en general</b>. El código se guarda en clases, de estas diferencias hablaré más adelante.</li>\n</ol>\n\n### Recursos\nComo ya mencioné, los recursos se manejan de manera similar, algo que me agradó de Android Studio es cómo muestra los recursos: fuera de las carpetas y con una anotación indicando a qué resolución pertenecen.  \n\nEn cuanto a la famosa clase <code>R</code>, en Xamarin.Android se llama <code>Resource</code> y su contenido es similar al que contiene en la tradicional, como podrás ver en el código más adelante.\n\n### El código\n\n#### MainActivity\n\n{% post_image MainActivity.png \"MainActivity\" %}\n\nDesde aquí se revelan algunas de las diferencias entre el código de C# y Java, por ejemplo, podemos ver que <code>using</code> ≈ <code>import</code>, o que el <code>namespace</code> es un equivalente de <code>package</code> y que las clases se llaman igual.\n\nAlgo importante a destacar es el código `[Activity(MainLauncher = true)]` que cumple la función de indicarle al manifiesto cuál es el punto de entrada a nuestra app (en <a href=\"../opening-files-xamarin-forms/#android\">este post</a> muestro las equivalencias entre el manifiesto y el atributo <code>Activity</code>).\n\n#### OnCreate\n\n{% post_image OnCreate.png \"OnCreate\" %}\n\nEn cuanto al método <code>OnCreate</code> y la declaración <code>View</code>s, las diferencias son mínimas, en C# para hacer referencia a la clase de la que se hereda se usa la palabra <code>base</code> en lugar de <code>super</code>. Por convención los métodos comienzan con mayúscula.\n\nAquí es donde se ven las similitudes entre la clase <code>R</code> y <code>Resource</code> para acceder a los recursos.\n\n\n##### FindViewById\n\n{% post_image FindViewById.png \"FindViewById\" %}\n\nUna vez creada la vista podemos acceder a los controles y referenciarlos desde la clase <code>Activity</code>, para esto usamos el método <code>FindViewById</code> y mientras que con Xamarin tenemos la opción de hacer el *cast* nosotros (como en Java), también podemos usar el método genérico <code>FindViewById<T>` que hará el *cast* por nosotros.\n\n#### Métodos y manejadores de evento\n\n{% post_image EventAssign.png \"Asignación de eventos\" %}\n\nEn cuanto a los métodos, la declaración es casi idéntica (y más con Java 8) ya que mientras que en C# se usa una expresión lambda en la que se define el comportamiento del botón, en Java se utiliza una clase anónima para realizar esta acción.\n\n### Código en general\n\n{% post_image Code.png \"Código Java & C#\" %}\n\nEn cuanto al código en general, me atrevería a decir que la traducción entre C# y Java no es muy complicada... son como hermanos, en realidad una de las más \"grandes\" diferencias es que en Java tenemos únicamente métodos para acceder a las propiedades de un objeto como es el caso de <code>length()`.\n\n## Interfaz gráfica\n\nEl editor de interfaces para Android que contiene Visual Studio o Xamarin Studio es idéntico al disponible en los editores de Android Studio o en Eclipse. Además de la vista \"en vivo\" del diseño también ambos nos dan acceso al xml del archivo.\n\n{% post_image Designer.png \"Editor de interfaces\" %}\n\n### En conclusión\n\nA diferencia de <a href=\"../xamarin-ios-vs-traditional\">C# y Swift</a>, las diferencias con Java no son notorias y creo que bien valdría la pena comenzar a hacer tu siguiente app con Xamarin para así poderla llevar a iOS sin mayor problema.\n\nRecuerda que el código de las apps tanto de C# y Java están <a href=\"https://github.com/ThatCSharpGuy/silo-xamarin-comparation\" target=\"_blank\" rel=\"nofollow\">disponibles en GitHub</a> par que las revises, si tienes alguna duda, no dudes en contactarme, al final del post están los enlaces necesarios.\n\n"
}