{	
	"id" : "/post/organizacion-codigo-visual-studio/",
	"tv" : false,
	"date": "2015-11-18 15:00:00 -0600",
	"title" : "¿Cómo organiza mi código Visual Studio?",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimagesfeatured.jpg",
	"tags" :
	[ 
		"VisualStudio",
		"Xamarin"
	],
	"content" : "<p>Si alguna vez has usado un IDE para desarrollar alguna aplicación tal vez te hayas preguntado cómo es que ese tipo de programas saben en dónde están los componentes para cada una de las cosas que hacen que tu app compile o funcione. En este post trataré de explicar cómo es que Xamarin y Visual Studio llevan este control.</p>

<h3 id=\"la-solucin\">La “Solución”</h3>
<p>Tanto Visual Studio como Xamarin Studio organizan nuestro código <em>assets</em>, liberías y demás en una estructura llamada Solución (<code>Solution</code> en inlglés), todo está almacenado en un archivo que tiene una extensión <code>.sln</code>. Este archivo  que le dice al IDE en dpnde están los proyectos de nuestra aplicación, es un archivo de texto plano, que es usualmente autogenerado por el entorno que estamos empleando para desarrollar.</p>

<p><figure><img src='/postimages/post/organizacion-codigo-visual-studio/post.jsonsolution-in-folder.png' alt='“Image of a solution file” images_set' /></figure></p>

<p>Así es como una <em>Solución</em> se ve cuando es abierta en Xamarin Studio y Visual Studio:</p>

<p><figure><img src='/postimages/post/organizacion-codigo-visual-studio/post.jsonsln-opened.png' alt='“Image of opened solutions” images_set' /></figure></p>

<p>Y así es como se ve el mismo archivo pero abierto en un editor de texto plano:</p>

<p><figure><img src='/postimages/post/organizacion-codigo-visual-studio/post.jsonsln-plain-text-explained-2.png' alt='“Image of opened solutions” images_set' /></figure></p>

<dl>
<dt>1. <i>Solución</i></dt>
<dd>El archivo como tal, el nombre que vemos en el IDE es el mismo nombre del archivo más la extensión <code>sln</code>.</dd>
<dt>2. Carpeta de solución</dt>
<dd>Estas son carpetas lógicas que podemos usar para mejorar la organización de nuestro código.</dd>
<dt>3. Proyecto compartido</dt>
<dd>Un proyecto compartido... veremos más de el en un siguiente post.</dd>
<dt>4. Proyecto de C#</dt>
<dd>Un proyecto de C#, en este caso se refiere a un proyecyto de Android, en Xamarin es una convenciín usar el sufijo <code>.Droid</code> para este tipo de proyectos.</dd>
<dt>5. Proyecto de C#</dt>
<dd>Otro proyecto de C#, en este caso se refiere a un proyecyto de iOS, en Xamarin es una convenciín usar el sufijo <code>.iOS</code> para este tipo de proyectos.</dd>
</dl>

<h3 id=\"el-archivo-algoproj\">El archivo .[algo]proj</h3>

<p>Como mencioné anteriormente, la <em>solución</em> lleva un control de los proyectos que componen nuestra aplicación… pero, ¿qué es exactamente un proyecto?</p>

<p>Bien, pues un proyecto es una manera lógica de organizar las clases, recursos imágenes necesarias para un cierto fin, este se describe en un archivo con extensión que termina en <code>proj</code>, siendo <code>.csproj</code> para proyectos C#, <code>.shproj</code> para proyectos compartidos y, por ejemplo, otros terminan en <code>.vbproj</code>, <code>.jsproj</code>, etc.</p>

<p>Como puedes ver en la imagen anterior, el archivo <code>.sln</code> contiene una especie de enlaces a esos proyectos.</p>

<p>Estos son los proyectos de la <em>Free Xamarin Shirt App</em>:</p>

<p><figure><img src='/postimages/post/organizacion-codigo-visual-studio/post.jsonfreeshirtappproject.png' alt='“Xamarin Free Shirt App” images_set' /></figure></p>

<h3 id=\"tldr\">tl;dr</h3>
<p>Podemos explicar cómo es que está organizado nuestro código con el siguiente diagrama:</p>

<p><figure><img src='/postimages/post/organizacion-codigo-visual-studio/post.jsonSolution-diagram.jpg' alt='“Diagram of how solution works” images_set' /></figure></p>
"
}