{	
	"id" : "/tv/martillo-dorado/",
	"tv" : true,
	"date": "2016-09-26 13:00:00 -0500",
	"title" : "El martillo dorado",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//tv/golden-hammer/featured.jpg",
	"tags" : ["Meta","Tv"],
	"content": "<p>El Martillo Dorado, Martillo de Maslow, La ley del Instrumeto o <em>Per simplex responsum</em> es una falacia lógica en la cual se cae cuando se usa la misma respuesta (o alguna forma de esta) para cualquier pregunta o problema, incluyendo aquellas para las que no es la mejor solución o, peor aún: para las que ni siquiera lo es.</p>\n\n<p>Seguramente has escuchado alguna de estas frases:</p>\n\n<blockquote>\n  <p>Supongo que es tentador, si la únca herramienta que tienes es un martillo, tratar todo como si fuera un clavo - <a href=\"https://books.google.com.mx/books?id=3_40fK8PW6QC&amp;printsec=frontcover#v=onepage&amp;q=Hammer&amp;f=false\">Abraham Maslow</a></p>\n</blockquote>\n\n<blockquote>\n  <p>Dale un martillo a un niño pequeño y este encontrará que todo lo que encuentra necesita ser golpeado - <a href=\"https://books.google.com.mx/books?id=OYe6fsXSP3IC&amp;pg=PA28&amp;dq=22law+of+the+instrument22+inauthor:kaplan&amp;redir_esc=y#v=onepage&amp;q=22law20of20the20instrument2220inauthor3Akaplan&amp;f=false\">Abraham Kaplan</a></p>\n</blockquote>\n\n<p>O básicamente cualquiera con esta forma</p>\n\n<blockquote>\n  <p>Si todo lo que tienes es un martillo, todo parece un clavo.</p>\n</blockquote>\n\n<p>El problema con la falacia del martillo dorado es no todo es un clavo, en otras palabras: no hay una solución que resuelva todos los problemas.</p>\n\n<h2 id=\"qu-tiene-que-ver-con-el-desarrollo-de-aplicaciones\">¿Qué tiene que ver con el desarrollo de aplicaciones?</h2>\n\n<p>He hecho algunos vídeos hablando sobre tecnologías de desarrollo y patrones de diseño. Y es con ellos que nosotros, los desarrolladores/arquitectos/ingenieros de software, podemos incurrir en la falacia del martillo dorado. Y es que aplicar <a href=\"../mvvm\" target=\"_blank\">el patrón MVVM</a> o <a href=\"../inyeccion-dependencias\" target=\"_blank\">la Inyección de Dependencias</a> no es la solución para todas las aplicaciones… y <a href=\"../xamarin-forms\" target=\"_blank\">Xamarin.Forms</a> no es siempre la mejor opción para desarrollar aplicaciones móviles.</p>\n\n<h2 id=\"qu-nos-lleva-a-querer-usar-el-martillo-para-todo\">¿Qué nos lleva a querer usar el martillo para todo?</h2>\n<p>Puede ser porque estamos muy familiarizados en alguna tecnología y se nos hace sencillo realizar estimaciones o planear sobre algo ya conocido. Otra razón es porque no conocemos otras alternativas y peor aún, porque las vemos como riesgosas sin conocerlas. Bajo estas condiciones es posible pensar en usar el martillo para todo.</p>\n\n<p>La solución es sencilla, aunque puede llevar un poco de tiempo, ya que consiste en ampliar nuestro conocimiento través de cursos, libros, escuela y lo más importante: <strong>la práctica</strong> con otras herramientas.</p>\n"
}