{	
	"id" : "/post/automapper/",
	"tv" : false,
	"date": "2016-03-28 13:00:00 -0600",
	"title" : "AutoMapper",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/automapper/featured.png",
	"tags" : ["NuGetRecomendado"],
	"content": "Hay muchas razones por las que como desarrolladores nos podemos ver en la necesidad de transferir, o mapear, información de un objeto a otro. Una de estas razones es para evitar el <a href=\"https://en.wikipedia.org/wiki/Mass_assignment_vulnerability\" target=\"_blank\" rel=\"nofollow\">Overposting</a>.\n\nEn general se emplea el mapeo en los límites entre componentes de un sistema, ya sea de la base de datos a la capa de lógica, de la lógica a la interfaz gràfica o de un servicio web de un tercero a nuestra app. El hecho de que existan los mapeos favorece la separación de responsabilidades en el código.\n\nPor ejemplo, cuando estamos trabajando con servicios web y recibimos un objeto simple y lo queremos transformar en algo con lo que nuestra aplicaciòn pueda trabajar, otro ejemplo es cuando somos nosotros los que enviamos la información de nuestra aplicación a través de un servicio web, sin embargo no queremos que el receptor tenga acceso a toda la información que tenemos disponible. \n\n## Ejemplo práctico\nSupongamos que tenemos un servicio web que sirve para consultar información sobre libros, de nuestra base de datos recuperamos la información a través de las siguientes entidades:\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\npublic class BookEntity\n\n    public int Id  get; set; \n    public string Title  get; set; \n    public string Subtitle  get; set; \n    public int Pages  get; set; \n    public int Edition  get; set; \n    public AuthorEntity Author  get; set; \n\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\npublic class AuthorEntity\n\n    public int Id  get; set; \n    public string Name  get; set; \n    public int Age  get; set; \n    public List<BookEntity> Books  get; set; \n\n\n  \n\n</pre>  \n</div>  \n</div>\n\nResponder a la petición de un usuario con dichas clases, representaría dar más información de la que se necesita, es por eso usaremos estas clases para responder a cada petición:\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\npublic class BookModel\n\n    public string FullTitle  get; set; \n    public int Pages  get; set; \n    public int Edition  get; set; \n    public string AuthorName  get; set; \n    public DateTime TimeSent  get; set; \n\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\npublic class AuthorModel\n\n    public string Name  get; set; \n    public int Age  get; set; \n    public int BooksCount  get; set; \n\n  \n  \n</pre>  \n</div>  \n</div>\n\nAhora bien, podríamos pensar en hacerlo manualmente:\n\n<pre class=\"csharp\">\nvar modeloAutor = new AuthorModel();\nmodeloAutor.Name = entidadAutor.Name;\nmodeloAutor.Age = entidadAutor.Age;\nmodeloAutor.BooksCount = entidadAutor.Books != null ? entidadAutor.Books.Count : 0;\n</pre>  \n\nPero no es una tarea sencilla si nuestros objetos comienzan a crecer en tamaño o complejidad... y ni hablar de lo aburrido que puede llegar a ser escribir cada mapeo \"a mano\". \n\n## AutoMapper  \nEs por eso que a <a href=\"https://github.com/jbogard\" target=\"_blank\" rel=\"nofollow\">Jimmy Bogard</a> se le ocurrió la idea de crear AutoMapper, que es una pequeña librería que nos ayudará a automatizar esta tarea. \n\nAutoMapper es un mapeador objeto-objeto que \"convierte\" un objeto de un tipo a otro, sin embargo lo que hace realmente útil a esta herramienta es que facilita la tarea mediante el uso de convenciones de código, que le ayudan a decidir qué propiedad de un tipo se mapea al otro. \n\n### Configuración\nPara comenzar a usar AutoMapper demebos configurarlo, para lo cual utilizaremos una instancia de la clase `MapperConfiguration`, a través del que configuraremos el mapeo:\n\n<pre class=\"csharp\">\nvar automappingConfiguration = new AutoMapper.MapperConfiguration(config =>\n\n    // Configurar mapeo\n</pre>  \n\n#### Convenciones  \n\nA partir de aquí se tiene que configurar cada mapeo objeto-objeto individualmente, necesitaremos dos tipos de dato una *fuente* y un *destino*, utilizando la variable `config` y su método `CreateMap` es como se realiza la tarea. Por ejemplo, para configurar el mapeo de `AuthorEntity` (la fuente) a `AuthorModel` (el destino) basta con una sola línea:\n\n<pre class=\"csharp\">\nconfig.CreateMap<AuthorEntity, AuthorModel>();\n</pre>  \n\nEsto se debe a que para este mapeo utiliza las convenciones definidas por AutoMapper:  \n  \n - Ambos tienen `Nombre` del tipo `string`  \n - Ambos tienen `Age` del tipo `int`\n - para `BooksCount` en el destino, AutoMapper busca una colección `Books`, y obtendrá el número de elementos que contiene.\n \n Esto hace que el mapeo sea automático entre las dos propiedades, estas convenciones están incluídas en la librería, sin embargo <a href=\"https://lostechies.com/joshuaflanagan/2010/03/19/teaching-automapper-about-our-conventions/\" target=\"_blank\" rel=\"nofollow\">podemos definir las nuestras</a>. \n \n#### Personalizado  \n \n Si tenemos unpar de objetos que requieren de un mapeo más complejo, tenemos a nuestra disposición algunos métodos adicionales, que nos ayudarán a configurar a mayor profundidad AutoMapper, toma por ejemplo las dos entidades `BookEntity` (la fuente) a `BookModel` (el destino):\n \n<pre class=\"csharp\">\nconfig.CreateMap<BookEntity, BookModel>()\n    .ForMember(dest => dest.AuthorName, \n        opt => opt.ResolveUsing(entity => entity.Author.Name))\n    .ForMember(dest => dest.FullTitle,\n        opt => opt.ResolveUsing(entity => entity.Title + \" \" + entity.Subtitle))\n    .ForMember(dest => dest.TimeSent, opt => opt.Ignore());\n</pre>  \n \nVeamos por partes lo que está sucediendo en el código anterior:\n\n 1. Con `config.CreateMap<BookEntity, BookModel>()` estamos indicando el inicio de una configuración de mapeo.  \n 2. Con el método `ForMember` le estamos indicando que la propiedad `AuthorName` en el destino la debe obtener de `Author.Name` en la fuente\n 3. Al igual que en la anterior, le estamos diciendo que `FullTitle` la obtenga de concatenar `Title`, un espacio en blanco y `Subtitle` de la fuente\n 4. El destino tiene una propiedad llamada `TimeSent` que no existe en la fuente, para asegurar que el mapeo sea correcto, le decimos a la configuración que la ignore mediante el método `Ignore`.\n\nPara este ejemplo no se requiere de una configuración más compleja, sin embargo si tu aplicación la requiere, puedes checar <a href=\"https://github.com/AutoMapper/AutoMapper/wiki/Custom-value-resolvers\" target=\"_blank\" rel=\"nofollow\"><i>custom resolvers</i></a>, <a href=\"https://github.com/AutoMapper/AutoMapper/wiki/Custom-type-converters\" target=\"_blank\" rel=\"nofollow\"><i>custom type converters</i></a>, <a href=\"https://github.com/AutoMapper/AutoMapper/wiki/Conditional-mapping\" target=\"_blank\" rel=\"nofollow\">mapeo condicional</a> o cualquier otra de las posibilidades que puedes consultar en la <a href=\"https://github.com/AutoMapper/AutoMapper/wiki\" target=\"_blank\" rel=\"nofollow\">documentación de AutoMapper</a>. \n\n### Uso\n\nUna vez que hemos <a href=\"#configuracion\">configurado</a> el mapeo, debemos llamar al método `CreateMapper` de la clase `MapperConfiguration`\n\n<pre class=\"csharp\">\nvar mapper = automappingConfiguration.CreateMapper();\n</pre>  \n\nla cual nos devolverá una instancia de un objeto que implementa `IMapper`, que es a través del cual se realizará cada mapeo. Luego, con esta instancia a nuestra disposición, bastará con llamar a `Map` pasándole una instancia de la fuente (desde la que queremos mapear) y el tipo del destino (al que queremos llegar):\n\n<pre class=\"csharp\">\n// De AuthorEntity a AuthorModel\nvar modeloAutor = mapper.Map<AuthorModel>(entidadAutor);\n\n// De BookEntity a BookModel\nvar modeloLibro = mapper.Map<BookModel>(bookEntity);\n</pre>\n\nComo podrás ver, podemos centralizar bastante la tarea de mapeo, y es que en tu aplicación **basta con tener una sola referencia a `IMapper`**, así que es lo normal que únicamente la asignes una vez y la reutilizes a través de una propiedad estática o un patrones de diseño de aplicaciones como DI o singleton.\n\n## Conclusión\nEste post apenas y roza la superficie de todo las posibilidades que AutoMapper tiene para nosotros y no cabe duda de que después de adentrarte en la documentación podrás encontrarle más utilidad. Además de que AutoMapper también es fácilmente integrable con patrones de diseño, incluyendo la Inyección de Dependencias. Si existe algo en lo que estés atorado con la configuración, tal vez pueda ayudar.\n \n# Instalación  \nPara instalarlo no hay mejor manera que el gestor de paquetes de NuGet:\n\n console titulo \nPM> Install-Package AutoMapper\n endconsole \n\nO échale un ojo al <a href=\"https://github.com/AutoMapper/AutoMapper\" target=\"_blank\" rel=\"nofollow\">proyecto en GitHub</a> y contribuir a su desarrollo de alguna manera."
}