{	
	"id" : "/post/linq-en-c-sharp-3/",
	"tv" : false,
	"date": "2016-02-08 14:00:00 -0600",
	"title" : "Linq en C# - tercera parte",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/linq-en-c-sharp/featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>Inmediatamente después de la <a href=\"/post/linq-en-c-sharp-2\">segunda parte de la serie de posts sobre Linq</a>, les traigo este, que es la tercera parte en donde hablaré sobre cómo trabajar con dos conjuntos de datos diferentes, con ellos se pueden realizar uniones y agrupaciones para obtener más conocimiento de la información que tenemos.</p>\n\n<h3 id=\"preparando-el-terreno\">Preparando el terreno</h3>\n<p>Nuevamente en este post me auxiliaré de los mismos elementos que en el post pasado: Las clases <code>Lecture</code>, <code>Teacher</code> y <code>FakeDatabase</code></p>\n\n<h2 id=\"agrupamientos-group-by--groupby\">Agrupamientos (group by , GroupBy)</h2>\n<p>Con Linq también podemos realizar agrupamientos de datos, esta función está disponible tanto en la sintaxis de método como en la de consulta y a mi parecer es mucho más entendible en la de consulta. Es importante señalar que cuando ejecutamos un agrupamiento tendremos acceso a una nueva colección de tipo <code>IGrouping</code>, y cada uno de esos <code>IGrouping</code>s contiene una propiedad <code>Key</code> que es del tipo de dato sobre el que ejecutamos el agrupamiento. Podríamos er un ejemplo sencillo si queremos saber cuantas clases tiene cada profesor:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar classesPerTeacherQuery =\n    from lecture in db.Lectures\n    group lecture by lecture.TeacherId into grp\n    select new\n    \n        TeacherId = grp.Key,\n        LectureCount = grp.Count()\n    ;\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar classesPerTeacherMethod = db.Lectures\n    .GroupBy(lecture =&gt; lecture.TeacherId)\n    .Select(grp =&gt;\n        new\n        \n            TeacherId = grp.Key,\n            LectureCount = grp.Count()\n        );\n</pre>  \n</div>  \n</div>\n\n<p>En este caso estamos agrupando las clases por maestro, a través de su llave <code>TeacherId</code>. Como se puede ver, cuando usamos la sintaxis de consulta es necesario especificar otro nombre para la colección resultante del agrupamiento, en este caso la llamamos <code>grp</code>, mientras que en la sintaxis de método no es necesario. Posteriormente podemos seguir trabajando con la colección agrupada, como en este caso que estamos creando un tipo anónimo con el Id del profesor y la cantidad de clases que imparten.</p>\n\n<p>En un ejemplo más complejo podríamos agrupar las clases que da cada maestro y luego agruparlas por nivel para después imprimirlas en pantalla:</p>\n\n<pre class=\"csharp\">\nvar groupedLecturesPerLevelAndTeacher =\n    from lecture in db.Lectures\n    group lecture by lecture.TeacherId into group1\n    select new\n    \n        TeacherId = group1.Key,\n        Levels = from level in group1\n                 group level by level.Level into group2\n                 select new\n                 \n                    LevelName = group2.Key,\n                    Lectures = group2.ToList()\n                 \n    ;\n</pre>\n\n<p>En este caso se puede decir que estamos haciendo un agrupamiento anidado: Primero estamos agrupando las <code>Lecture</code>s por el maestro que las imparte, el resultado de esta agrupación lo estamos colocando en <code>group1</code>, después, mediante la cláusula <code>select</code> estamos creando un nuevo tipo que tiene como propiedades <code>TeacherId</code> y <code>Level</code> que es creado a de la agrupación de las clases por la propiedad <code>Level</code> (que ponemos en <code>group2</code>) para posteriormente crear una colección de objetos con <code>LevelName</code> y <code>Lectures</code>.</p>\n\n<p>También se pueden hacer agrupamientos un poco más complejas cuando usamos la sintaxis de método, ya que permite especificar una instancia de clase que implementa la interfaz <code>IEqualityComparer&lt;T&gt;</code> mediante la cual se implementa el método <code>Equals(T, T)</code> que indica cómo se van a agrupar los elementos.</p>\n\n<h2 id=\"uniones-join-join\">Uniones (join, Join)</h2>\n<p>Una de las características más interesantes de Linq es la de poder hacer uniones entre conjuntos de datos a partir de una propiedad en ellos, la forma de hacer los <em>join</em> en Linq es muy similar a la forma en que se realizan los <code>inner join</code> en SQL puesto que es necesario especificar un campo sobre el que se realizará la unión:</p>\n\n<p>En las consultas anteriores sobre <code>db.Lectures</code> únicamente tenemos acceso a <code>TeacherId</code>, pero supongamos que también queremos acceder a la información del profesor asignado a una clase. Es ahí cuando debemos hacer un <code>join</code>:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar q5 =\n    from l in db.Lectures\n    group l by l.TeacherId into grouped\n    join t in db.Teachers on grouped.Key equals t.Id\n    select new\n    \n        TeacherName = t.GivenName,\n        TeacherId = t.Id,\n        LectureCount = grouped.Count()\n    ;\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar q5alt = db.Lectures\n    .GroupBy(l =&gt; l.TeacherId)\n    .Join(db.Teachers, grouped =&gt; grouped.Key, t =&gt; t.Id,\n    (grouped, t) =&gt; new\n    \n        TeacherName = t.GivenName,\n        TeacherId = t.Id,\n        LectureCount = grouped.Count()\n    );\n</pre>  \n</div>  \n</div>\n\n<p>Definitivamente hacer los <em>join</em> en la sintaxis de consulta es la mejor opción puesto que se convierten en una instrucción más legible. En el código anterior podemos ver que el <em>join</em> se compone de tres palabras:</p>\n\n<ul>\n  <li>Un alias que va después de la palabra <code>join</code></li>\n  <li>Un origen de datos que va después de la palabra <code>in</code></li>\n  <li>Una condición bajo la que se realizará la unión después de la palabra <code>on</code></li>\n</ul>\n\n<p>Si has escrito SQL seguramente te resultará conocida esta sintaxis.</p>\n\n<h2 id=\"operaciones-de-un-elemento-first-single-elementat\">Operaciones de un elemento (First, Single, ElementAt)</h2>\n<p>Como vimos antes, podemos usar <code>Take</code> para obtener una cantidad fija de elementos de una secuencia, sin embargo, para obtener uno solo es recomendable usar los métodos como <code>Single</code>, <code>First</code> o <code>ElementAt</code> y sus similares para dicha tarea. Estos métodos no están disponibles a través de la sintaxis de consulta, únicamente a través de la de método.</p>\n\n<p>Por ejemplo, vamos a trabajar con un conjunto de maestros ordenados por su apellido:</p>\n\n<pre class=\"csharp\">\nvar q6 = from l in db.Teachers\n            orderby l.LastName descending\n            select l;\n</pre>\n\n<h3 id=\"first\">First</h3>\n\n<p>Si queremos obtener el primer maestro:</p>\n\n<pre class=\"csharp\">\nvar maestro1 = q6.First();\n</pre>\n\n<p><code>First</code> también acepta una condicional, digamos que queremos obtener el primer maestro que tiene como nombre “Cosme Fulanito”:</p>\n\n<pre class=\"csharp\">\nvar cosmeFulanito = q6.First(m =&gt; m.GivenName == \"Cosme\" &amp;&amp; m.LastName == \"Fulanito\");\n</pre>\n\n<p>Con este tipo de operaciones debemos ser muy cuidadosos, porque en el ejemplo pasado, al no existir un maestro llamado “Cosme Fulanito”, el método <code>First</code> lanza una excepción del tipo <code>InvalidOperationException</code>, lo cual ocurre si el conjunto sobre el que operamos no contiene elemento alguno que cumpla la condición (o si no indicamos condición basta con que el conjunto esté vacío).</p>\n\n<p>Para evitar la excepción podemos usar el método <code>FirstOrDefault</code> el cual regresará el valor por default del elemento del conjunto sobre el que trabajamos, hay que recordar que el valor por default de un tipo por referencia es <code>null</code>:</p>\n\n<pre class=\"csharp\">\nvar cosmeFulanito2 = q6.FirstOrDefault(m =&gt; m.GivenName == \"Cosme\" &amp;&amp; m.LastName == \"Fulanito\");\n</pre>\n\n<h3 id=\"single\">Single</h3>\n\n<p>Adicionalmente a <code>First</code>, también existe el método <code>Single</code> y <code>SingleOrDefault</code> <strong>pero solamente deben ser usados cuando el conjunto sobre el que operan únicamente contiene 1 solo elemento</strong>, ya que de otro modo obtendremos una espantosa excepción, por ejemplo, si ejecutáramos <code>Single</code> sobre <code>q6</code> obtendríamos una excepción porque tenemos más de 1 maestro en nuestra base de datos falsa:</p>\n\n<pre class=\"csharp\">\nvar maestro3 = q6.Single(); // Excepción porque q6 contiene más de 1 elemento\n</pre>\n\n<p>Tal vez te estés preguntando para qué existe <code>Single</code> si ya existe <code>First</code> y yo al igual que muchos coincido en que todo es cuestión de semántica en nuestro código. Si queremos dejar claro que una consulta a la base de datos, a un XML o a cualquier otra cosa a través de Linq debe siempre regresar un solo resultado debemos usar <code>Single</code>, si esperamos obtener el primer resultado de un conjunto más grande debemos usar <code>First</code>.</p>\n\n<h3 id=\"elementat\">ElementAt</h3>\n<p>No no siempre vamos a necesitar el primer elemento de una colección, tal vez estemos buscando el segundo, el décimo o el noningentésimo… uno nunca sabe. Para realizar esta tarea tenemos a nuestra mano el método <code>ElementAt</code> que obtiene el elemento colocado en la posición especificada mediante un entero:</p>\n\n<pre class=\"csharp\">\nvar maestroSegundo = q6.ElementAt(2);\n\nvar maestroDecimo = q6.ElementAt(10);\n</pre>\n\n<p>En este caso también debemos ser cuidadosos ya que, si nuestro conjunto no contiene al menos la cantidad de elementos necesaria para cumplir nuestra petición, obtendremos otra excepción, en este caso una del tipo <code>ArgumentOutOfRangeException</code>, así pues que cuando se solicita al maestro 900 obtendremos el error:</p>\n\n<pre class=\"csharp\">\nvar maestroNoningentesimo = q6.ElementAt(900); // Excepción ¡porque q6 no tiene 900 maestros!\n</pre>\n\n<h4 id=\"lo-que-sigue\">Lo que sigue</h4>\n<p>Aún quedan algunas cuantas herramientas de Linq por demostrar, entre ellas las intersecciones, uniones y demás operaciones sobre conjuntos que se pueden realizar. Sin duda espero haberte convencido (o demostrado) que el poder de esta característica que nos ofrece .NET es bastante bueno y que no debe pasarse por alto cuando desarrollas. Como siempre, recuerda que todo el código fuente de este post está en la información (cerca del título).</p>\n"
}