{	
	"id" : "/post/metas-blog-2017/",
	"tv" : false,
	"date": "2017-01-02 12:31:38 -0600",
	"title" : "Metas de That C# guy en 2017",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//meta/2017.png",
	"tags" : ["Meta"],
	"content": "<p>Antes de comenzar:</p>\n\n<blockquote>\n  <p>Te deseo a ti, que estás leyendo esto, un feliz y próspero año nuevo</p>\n</blockquote>\n\n<p>Este es un post muy distinto a la temática en general que manejo en este blog, y es que, con motivo del inicio de este nuevo año, me tomé un momento para reflexionar y pensar sobre la dirección que le voy a dar a este sitio y quería compartir las conclusiones (en forma de objetivos) a los que llegué con respecto al blog.</p>\n\n<h2 id=\"publicar-aplicaciones\">Publicar aplicaciones</h2>\n<p>Por mi cuenta he algunas aplicaciones tanto en la tienda de Windows como en la de Android, sin embargo, la mayoría no son… dignas de ser presumidas como me gustaría. Es por eso que a lo largo de este año tengo el firme propósito de crear una o varias aplicaciones completas y totalmente funcionales, usando los conocimientos que ya poseo y añadiéndole los que vaya aprendiendo.</p>\n\n<p>Desde luego y como ha sido hasta este momento, iré publicando en este blog consejos, tips y experiencias con las que me encuentre mientras desarrollo dichas aplicaciones.</p>\n\n<h2 id=\"este-blog\">Este blog</h2>\n<p>Mantendré el firme compromiso de publicar un artículo cuando menos una vez a la semana, esta vez trataré de establecer un calendario editorial que haga que exista cierta continuidad entre algunos temas relacionados.</p>\n\n<p>También me gustaría retomar los post del tipo: “¿Qué puedo hacer con C#?” o “NuGet recomendado”. Pero para esto me gustaría pedirles su participación en una “pequeña” encuesta, la cual me ayudará a darme una idea sobre los temas que les interesan. Si pueden y quieren participar, aquí dejo el enlace:</p>\n\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdU0tSS9YEAq_RfIRplSTq7sar0f378OwwnIy1mSchGGYdjiA/viewform\"><br />\n<img src=\"/postimages/meta/encuesta2017.png\" title=\"Encuesta de TCSG\" />\n</a></p>\n\n<h3 id=\"en-ingls\">En inglés</h3>\n<p>También me gustaría publicar un poco más en inglés, y no solo por gusto, sino que en verdad es una herramienta necesaria para quien se dedica a desarrollar aplicaciones. Procuraré publicar los posts más importantes en los dos idiomas, aunque no siempre sea posible publicar ambos al mismo tiempo.</p>\n\n<h2 id=\"youtube\">YouTube</h2>\n<p>Confío en que este año sea mejor para el canal de YouTube, publicando al menos una vez cada quince días, alternando entre un tema teórico y uno práctico, retomando así lo que al inicio del canal plantee como sus objetivos. Buscaré también la posibilidad de crear una serie de videos sobre cómo utilizar las tecnologías de las que hablo en este blog, enfocados totalmente en la práctica.</p>\n\n<p>Si aún no estás suscrito al canal, te invito a que lo veas y si te gusta, suscribirte:</p>\n\n<script src=\"https://apis.google.com/js/platform.js\"></script>\n\n<div class=\"g-ytsubscribe\" data-channelid=\"UC8KCb358oioQMcJ5pUfs8UQ\" data-layout=\"full\" data-count=\"default\"></div>\n\n<h2 id=\"tu\">Tu</h2>\n<p>Sí, tu. Tu eres parte importantísima de este blog, es por eso que me gustaría saber si existe algo en particular que te gustaría ver en este sitio: desde una sección de preguntas y respuestas, una serie de posts o alguna explicación sobre algún tema que te cueste entender.</p>\n\n<p>De verdad me interesa conocer tu opinión, recuerda que me la puedes hacer llegar todas tus dudas, quejas y comentarios por las vías usuales: <a href=\"http://twitter.com/io_exception\" target=\"_blank\">Twitter</a>, <a href=\"mailto:feregrino@thatcsharpguy.com\" target=\"_blank\">Email</a> y <a href=\"https://www.facebook.com/thatcsharpguy\" target=\"_blank\">Facebook</a>.</p>\n\n<p>Y de nuevo, si puedes y quieres contestar <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdU0tSS9YEAq_RfIRplSTq7sar0f378OwwnIy1mSchGGYdjiA/viewform\" target=\"_blank\">la encuesta</a>: muchas gracias.</p>\n"
}