{	
	"id" : "/post/arreglos-en-c-sharp-parte-1/",
	"tv" : false,
	"date": "2015-10-22 16:00:00 -0500",
	"title" : "Arreglos en C# (unidimensionales)",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/arreglos-en-c-sharp-parte-1/featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>En C# llamamos arreglo a una colección de objetos, dicha colección tiene longitud definida y esta no puede cambiar con el flujo del programa, esto podrá sonar limitante, pero al trabajar con arreglos se obtiene un mejor desempeño que con cualquier otra colección. Usando el lenguaje podemos crear, recorrer y manipular arreglos de cualquier tipo de objeto.</p>\n\n<h3 id=\"unidimensionales\">Unidimensionales</h3>\n<p>Comenzando por lo más básico, los arreglos unidimensionales son colecciones lineales, que nos pueden ayudar a representar una secuencia numérica, letras del alfabeto o un cromosoma dentro de un programa de algoritmos genéticos, entre muchas otras otras.</p>\n\n<h4 id=\"instanciacin\">Instanciación</h4>\n<p>Para crear un arreglo haremos uso de la palabra reservada <code>new</code> y los corchetes cuadrados <code>[ ]</code>, también es necesario conocer el tamaño que necesitaremos, puesto que como ya lo mencioné, no es posible cambiar el tamaño una vez creado:</p>\n<pre class=\"csharp\">\nchar [] vocales = new char[5];\n\nint [] conteo = new int[10];\n\nobject [] misObjetos = new object[3];\n</pre>\n<p>Si creamos arreglos de esa manera, cada posición tendrá el valor por default del tipo de dato del arreglo… bueno, mejor usamos nuestro ejemplo:</p>\n\n<ul>\n  <li>El arreglo de <code>vocales</code> contendrá 5 <code>\\0</code>, que es el valor por default de un <code>char</code>.</li>\n  <li>El arreglo <code>conteo</code> contendrá 10 <code>0</code>, que es el valor por default de un entero.</li>\n  <li>El arreglo <code>misObjetos</code> contendrá 3 <code>null</code>, que es el valor por default de un <code>object</code>.</li>\n</ul>\n\n<p><br /><br />\nAdemás de la instanciación tradicional, también podemos emplear la instanciación de colecciones, la cual nos permite inicializar un arreglo asignándole valores inmediatamente:</p>\n<pre class=\"csharp\">\nchar [] vocales = new char[5]  'a', 'e', 'i', 'o', 'u' ;\n\nint [] conteo = new int[]  1, 2, 3, 4, 5, 6, 7, 8, 9, 0 ;\n\nobject [] misObjetos =  \"3\", 1, 99.99 ;\n</pre>\n<p>Como podemos ver, tenemos varias opciones para inicializar arreglos unidimensionales:</p>\n\n<ol>\n  <li><code>new char[5]  ...</code>, nos permite indicar el tamaño y el tipo explícitamente y posteriormente indicar los valores, si cambiáramos el <code>5</code> por un <code>7</code>sin aumentar la cantidad de valores obtendríamos un error de compilación.</li>\n  <li><code>new int[]  1, 2, ...</code>, nos permite indicar solamente el tipo de dato de los elementos, la cantidad es inferida por el compilador, en este caso podemos incrementar o reducir la cantidad de elementos al momento de inicializar sin ningún problema.</li>\n  <li><code> \"3\", 1, 99.99 </code>, al inicializar de esta manera estamos dejandole al compilador la tarea de inferir tanto el tipo de dato del arreglo como la cantidad de elementos que contiene. Dicho sea de paso, el declarar un arreglo así puede resultar un poco confuso de leer.</li>\n</ol>\n\n<h4 id=\"acceso-a-los-elementos\">Acceso a los elementos</h4>\n<p>Una vez instanciado, podemos acceder a los elementos del arreglo usando nuevamente los corchetes cuadrados <code>[ ]</code> y el índice del elemento al que queremos acceder. Nota importante <strong>los arreglos están indizados en 0</strong> es decir, el primer elemento de un arreglo está en el índice 0.</p>\n\n<p>Retomemos los arreglos del ejemplo pasado. Para acceder a la <code>a</code> dentro del arreglo <code>vocales</code> debemos acceder a la posición <code>0</code>:</p>\n<pre class=\"csharp\">\nConsole.WriteLine(vocales[0]); // a\n</pre>\n<p>O, digamos que queremos reemplazar la <code>i</code> por una <code>t</code>:</p>\n<pre class=\"csharp\">\nvocales[2] = 't';\nConsole.WriteLine(vocales[2]); // t\n</pre>\n\n<h4 id=\"propiedades-y-mtodos\">Propiedades y métodos</h4>\n<p>A pesar de que los arreglos implementan la interfaz <code>IList</code>, con todo y sus propiedades, la única rescatable para los arreglos unidimensionales es la propiedad <code>Length</code> (o <code>LongLength</code> si metemos más de 2^32-1 elementos en el arreglo), que nos devuelve la longitud del arreglo:</p>\n<pre class=\"csharp\">\nConsole.WriteLine(vocales.Length); // 5\n\nConsole.WriteLine(conteo.Length); // 10\n\nConsole.WriteLine(misObjetos.Length); // 3\n</pre>\n\n<h5 id=\"posdata\">Posdata</h5>\n<p>Sin importar su contenido, los arreglos siempre son tipos por referencia, por lo que es posible tener las siguientes líneas de código:</p>\n<pre class=\"csharp\">\nint [] arreglo = null;\ndouble [] nulo = null;\n</pre>\n\n<h4 id=\"lo-que-sigue\">Lo que sigue</h4>\n<p>Inicialmente este post conendría todos los tipos de arreglos que permite crear C#, pero al final he decidido separarlos para hacerlo un poco más entendible, puedes visitar el siguiente sobre <a href=\"/post/arreglos-en-c-sharp-parte-2\">arreglos multidimensionales en C#</a>.</p>\n"
}