{	
	"id" : "/post/clases-partial-c-sharp/",
	"tv" : false,
	"date": "2016-06-06 14:00:01 -0500",
	"title" : "Clases parciales en C#",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//aprende-c-sharp/partial-featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>Esta vez toca hablar de otra de las características de C# (y de .NET en general). Esta vez son las clases parciales.</p>\n\n<p>Tal vez alguna vez te hayas encontrado con que, en la declaración de una clase, la palabra <code>partial</code> está antepuesta a la palabra <code>class</code>. Pero, ¿qué significa esto?</p>\n\n<p>Que una clase esté marcada como <code>partial</code> o parcial, significa que la definición de esta puede estar distribuida en más de un bloque de código. Por ejemplo, mira la definición completa de la clase <code>Program</code>:</p>\n\n<pre class=\"csharp\">\nnamespace Parciales\n\n    // Block 1\n    partial class Program\n    \n        public static void Main(string[] args)\n        \n            Write(HelloWorldString);\n        \n    \n\n    // Class constants. Block 2\n    partial class Program\n    \n        private const string HelloWorldString = \"Hola mundo!\";\n    \n\n</pre>\n\n<p>En este caso, la clase está declarada en dos bloques.</p>\n\n<p>Esto parece no muy útil, ¿cierto? sin embargo, la ventaja de las clases parciales es que nos permite separar la definición de una clase a través de varios archivos, por ejemplo, podríamos tener el archivo <em>Program.cs</em> y el archivo <em>ProgramMethods.cs</em> para separar la programación de la clase. En el ejemplo anterior, el método <code>Write</code> está definido en otro archivo, que contiene otra definición parcial de la clase:</p>\n\n<pre class=\"csharp\">\npartial class Program\n\n    public static void Write(string line)\n    \n        Console.WriteLine(line);\n    \n\n</pre>\n\n<p>Cuando llega el momento de compilar, <strong>el compilador tomará todas las definiciones parciales de una clase y la convertirá en una sola</strong>, es por eso que si escribimos la misma firma de método o nombre de propiedad en dos archivos diferentes obtendremos un error de compilación.</p>\n\n<p>Y… eso es todo lo que necesitas saber sobre clases parciales.</p>\n\n<p>¡NO! aguarda, aún hay más. La posibilidad de dividir la definición de una clase en múltiples archivos es una de las más criticadas, ya que usada sin cuidado puede transformar tu código (y los archivos en los que está definido) en un verdadero laberinto. Es por eso que hay ciertos escenarios en los que su uso es recomendado y fuera de ellos su uso debería ser restringido.</p>\n\n<p>Veamos algunos de los usos comunes:</p>\n\n<h3 id=\"definicin-de-interfaz-grfica\">Definición de interfaz gráfica</h3>\n<p>Si has trabajado con tecnologías como Windows Forms, Web Forms, y más reciente, Xamarin Forms, tal vez te hayas dado cuenta que junto a la definición de la interfaz gráfica (un archivo .aspx o .xaml) se genera automáticamente un archivo que contiene una clase parcial en donde están declarados los controles que definiste en la pantalla. A su vez existe otro archivo en el que tu puedes escribir la lógica de tu aplicación.</p>\n\n<p>Es decir, existe un archivo para la interfaz y otro para la lógica, esto resulta bastante útil ya que nos evita correr el riesgo de modificar el código que define la interfaz y nos quita de la vista código que realmente nosotros nunca escribimos por nuestra cuenta.</p>\n\n<p><small>Aún recuerdo cuando usé NetBeans con Java Swing. Seguramente también recuerdas ese bloque enorme de código que no puedes modificar… ewww</small></p>\n\n<p>Por ejemplo, mira estas clases, tal vez re recuerden algo:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n\n<h4>Lógica</h4>\n\n<pre class=\"csharp\">\npublic partial class Page\n\n    public Page()\n    \n        InitializeComponent();\n        Console.WriteLine(Control1);\n        Console.WriteLine(Control2);\n        Console.WriteLine(Control3);        \n    \n\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n\n<h4>Código generado</h4>\n\n<pre class=\"csharp\">\n// This code was generated by a tool, \n// any changes made to this file will be discarded\npublic partial class Page\n\n    object Control1;\n    object Control2;\n    object Control3;\n\n    void InitializeComponent()\n    \n        // ...code\n    \n\n</pre>  \n</div>  \n</div>\n\n<h3 id=\"reutilizar-cdigo\">Reutilizar código</h3>\n<p>Otro buen uso surgió junto con los <em>shared projects</em>, y es que con ellos podemos concentrar el código que se puede compartir en un solo archivo y dejar las implementaciones específicas para cada plataforma. el de abajo es un ejemplo muy burdo, pero te puede dar una idea:</p>\n\n<p><strong>Core.cs</strong> en el proyecto compartido</p>\n<pre class=\"csharp\">\npublic partial class Core\n\n    public Core()\n    \n        #if __ANDROID__\n        int camera = 0;\n        string options = \"\";\n        var photo = TakePhoto(camera, options);\n        #elif __IOS__\n        string camera = \"\";\n        var photo = TakePhoto(camera);\n        #endif\n\n        int byteCount = photo.Length;\n    \n\n</pre>\n\n<p><strong>CoreAndroid.cs</strong> en el proyecto de Android</p>\n<pre class=\"csharp\">\npublic partial class Core\n\n    byte[] TakePhoto(int camera, string options) \n    \n        return new byte[0];\n    \n\n</pre>\n\n<p><strong>CoreiOS.cs</strong> en el proyecto de iOS</p>\n<pre class=\"csharp\">\npublic partial class Core\n\n    byte[] TakePhoto(string camera) \n    \n        return new byte[0];\n    \n\n</pre>\n\n<h2 id=\"trabajo-en-equipo\">Trabajo en equipo</h2>\n<p>Con anterioridad se recomendaba que si varios programadores trabajaban en una clase, esta se dividiera en varios archivos para hacer <em>más</em> sencillo el trabajo a la hora de juntar los cambios, actualmente podemos usar con más seguridad algún <a href=\"http://localhost:4000/tv/control-versiones/\">sistema de control de versiones</a> para la misma tarea.</p>\n\n<h2 id=\"simplificar-el-cdigo\">“Simplificar” el código</h2>\n<p>Eh, pues simplemente eso, “simplificar” una clase larga para facilitar su lectura. En realidad, creo que si tienes una clase muy grande, antes de considerar separarla en varios archivos, debes considerar repasar tu diseño de aplicación y separar tu clase en varias clases. Si después de pensarlo, usar clases parciales sigue siendo la única opción, pues lo puedes hacer.</p>\n\n<h3 id=\"lo-que-sigue\">Lo que sigue</h3>\n<p>No olvides que puedes <a href=\"https://github.com/ThatCSharpGuy/aprende-c-sharp/tree/master/Parciales\" target=\"_blank\" rel=\"nofollow\">descargar el código fuente</a> para que hagas pruebas con él.</p>\n\n<p>Volviendo a las clases parciales, los mejores casos de uso son para herramientas que generan código o para maximizar la cantidad de código compartido, fuera de esos escenarios, su uso es bastante criticado ya que, si abusas de ellas, el código se puede tornar confuso al estar distrinuído en distintos archivos. Como siempre, nunca está de más conocer otra herramienta para cuando llega el momento de programar.</p>\n"
}