{	
	"id" : "/post/directivas-preprocesador-c-sharp/",
	"tv" : false,
	"date": "2016-02-29 04:00:00 -0600",
	"title" : "Directivas de preprocesamiento en C#",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/directives/featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>A pesar de que C# no tenga un preprocesador de código dedicado (tal como lo tiene C), aún podemos hacer uso de algunas instrucciones que modifican el comportamiento del compilador, a estas palabras se les conoce como <strong>directivas</strong>.</p>\n\n<h3 id=\"sintaxis\">Sintaxis</h3>\n<p>La sintaxis de una directiva es simple: comienza por el símbolo <code>#</code> seguido inmediatamente por la instrucción para el compilador. Por ejemplo:</p>\n\n<pre class=\"csharp\">\n#define esta_es_una_directiva\n#region Directivas\n#if esta_es_una_directiva\n#endif\n#endregion\n</pre>\n\n<h3 id=\"instrucciones-disponibles\">Instrucciones disponibles</h3>\n<p>Podemos dividir las directivas dentro estas categorías:</p>\n\n<h4 id=\"definicin-de-smbolos-de-compilacin\">Definición de símbolos de compilación</h4>\n<p>Primero que nada: En C#, un símbolo de compilación es una palabra (distinta de <code>true</code> o <code>false</code>) que es definida al momento de compilar el programa. Normalmente es el entorno en el que desarrollamos el encargado de definir dichos símbolos, por ejemplo, en Visual Sutdio cuando ejecutamos un programa en configuración Debug, el símbolo <code>DEBUG</code> es definido para nuestro código, o en Xamarin.Forms los símbolos <code>WINDOWS</code>, <code>IOS</code> y <code>ANDROID</code> son definidos dependiendo del proyecto que estamos compilando.</p>\n\n<p>Pero nosotros también podemos definirlos mediante el uso de la directiva <code>#define [símbolo]</code> y borrar la definición mediante <code>#undef [símbolo]</code>. Mira el siguiente código:</p>\n\n<pre class=\"csharp\">\n#define HOLA\n#define mundo\n#define PIZZA\n#undef mundo\n</pre>\n\n<p>En este caso para el archivo quedarán definidos los símbolos <code>HOLA</code> y <code>PIZZA</code>, estas definiciones se hacen con una sola intención, que veremos más adelante. Hay que señalar que las definiciones deben ser las primeras instrucciones en cada archivo.</p>\n\n<h4 id=\"compilacin-condicional\">Compilación condicional</h4>\n<p>Las directivas <code>#if</code>, <code>#else</code>, <code>#elif</code> y <code>#endif</code> permiten modificar el código que el compilador toma en cuenta para la compilación, funcionan de modo similar a un <code>if</code> en C#: <code>#if [condición]</code>, salvo que las condiciones simplemente son si determinado símbolo está definido o no, por ejemplo:</p>\n\n<pre class=\"csharp\">\n#if HOLA &amp;&amp; mundo\nConsole.WriteLine(\"Hola mundo\");\n#elif HOLA\nConsole.WriteLine(\"Hola\");\n#elif mundo\nConsole.WriteLine(\"Hola\");\n#else\nConsole.WriteLine(\"...\");\n#endif\n\n#if (HOLA || mundo) &amp;&amp; PIZZA\nConsole.WriteLine(\"Hola o mundo y ¡pizza!\");\n#endif\n</pre>\n\n<p>El resultado de la ejecución es</p>\n\n<pre>\nHola  \nHola o mundo y ¡pizza!\n</pre>\n\n<p>Los usos de la compilación condicional son muy variados, desde indicar que cierta porción de código únicamente se compile cuando estamos vamos a ejecutar una versión de prueba de nuestra aplicación hasta compilar distinto código fuente de acuerdo a la plataforma en la que se estará ejecutando la aplicación.</p>\n\n<h4 id=\"generar-errores-y-warnings\">Generar errores y warnings</h4>\n<p>Podemos usar las directivas <code>#error</code> y <code>#warning</code> para hacer que el compilador “encuentre” errores y advertencias en nuestro código. La sintaxis es la siguiente: <code>#error [mensaje]</code> y <code>#warning [mensaje]</code>, por ejemplo:</p>\n\n<pre class=\"csharp\">\n#warning It is dangerous to go alone!\n#error Hola! soy un error de compilación\n</pre>\n\n<p>Pero, ¿para qué querríamos provocar errores o <em>warnings</em> en nuestro código? yo creo que nadie. Sin embargo, usando la compilación condicional podemos “impedir” que el código se compile a menos que alguna configuración se cumpla, es por eso que normalmente estas directivas vienen rodeadas de <code>#if</code>, <code>#endif</code> o <code>#elif</code>:</p>\n\n<pre class=\"csharp\">\n#if !DEBUG\n#error Whoops, este código solamente puede ser usado en configuración debug\n#endif\n</pre>\n\n<h4 id=\"supresin-de-warnings\">Supresión de <em>warnings</em></h4>\n<p>Del mismo modo que podemos crear <em>warnings</em>, también podemos instruir al compilador a que ignore algunas de estas mediante el uso de la directiva <code>#pragma warning disable ([identificador de advertencias])</code>.</p>\n\n<p>Nunca ha sido bueno ignorar las advertencias en nuestro código … sin embargo se me ocurren dos escenarios principales:</p>\n\n<ul>\n  <li>Cuando accederemos al código de nuestro programa mediante reflexión y el compilador nos advierte que no estamos usando determinada propiedad o método.</li>\n  <li>Cuando estamos implementando una interfaz y nuestro código únicamente llama a algunos métodos de la interfaz</li>\n</ul>\n\n<p>Cuando deshabilitamos el reconocimiento de advertencias con la directiva anterior, el efecto permanece hasta el fin del archivo, pero podemos deshabilitar dicho efecto usando la directiva <code>#pragma warning restore ([identificador de advertencias])</code>. Tomemos como ejemplo esta porción de código que como te podrás imaginar, provoca unas cuantas advertencias.</p>\n\n<pre class=\"csharp\">\nint x = 0;\nreturn;\nint zero = 0;\nif (1 != null) ;\n</pre>\n\n<p>post_image warnings.png “Warnings”</p>\n\n<p>Podemos deshabilitar las advertencias una por una:</p>\n<pre class=\"csharp\">\n#pragma warning disable 219\n            int x = 0;\n</pre>\n\n<p>Varias a la vez:</p>\n\n<pre class=\"csharp\">\n#pragma warning disable 162,219\n            int zero = 0;\n</pre>\n\n<p>O simplemente todas a la vez:</p>\n\n<pre class=\"csharp\">\n#pragma warning disable\n            if (1 != null) ;\n</pre>\n\n<h4 id=\"organizacin-de-cdigo\">Organización de código</h4>\n<p>Estas son es seguramente las directivas con las que más frecuentemente te has encontrado, y es que su uso es mucho más común que las otras, su finalidad es agrupar físicamente bloques de código dentro de nuestro archivo fuente, además de que algunos IDE permiten colapsar el texto entre ella. Es importante decir que su inclusión no modifica el comportamiento del compilador.</p>\n\n<p>Por ejemplo:</p>\n\n<pre class=\"csharp\">\n#region Super bloque de código\nConsole.WriteLine(\"Hola\");\n#endregion\n</pre>\n\n<p>Que en Visual Studio se ve así:</p>\n\n<p>post_image region.gif “Region directive”</p>\n\n<h4 id=\"para-finalizar\">Para finalizar</h4>\n<p>Como puedes ver, las directivas nos pueden ayudar a personalizar nuestro código a partir de condiciones dictadas antes de la compilación del mismo, o a “forzar” que ciertas condiciones se cumplan para que siquiera compile. También nos ayudan a organizar nuestro código en bloques físicos dentro del archivo fuente.</p>\n\n"
}