{	
	"id" : "/post/docx-c-sharp/",
	"tv" : false,
	"date": "2016-02-15 13:00:00 -0600",
	"title" : "Trabajando con DocX en C#",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimagesfeatured.png",
	"tags" :
	["NuGetRecomendado"],
	
	"content" : body"Me atrevería a decir que la gran mayoría de aplicaciones tienen una forma de reportar sus acciones al usuario a través de determinada interfaz. La interfaz más famosa es el monitor de la computadora ya sea mediante imágenes, vídeo o texto, pero no a todos lados es práctico andar cargando con una pantalla, ¿cierto? Es por eso que muchas aplicaciones también ofrecen la posibilidad de descargar su información en forma de documentos de texto, de tal forma que el usuario las pueda descargar e imprimir.  \n\nMuchos conocen a esta acción como \"Generación de informes o reportes\" y hay una enorme cantidad de herramientas para realizarla, entre ellas están el `ReportViewer` de Microsoft o el Telerik, Crystal Reports de SAP, o alguna de las herramientas de Aspose. Mientras que todas esas herramientas son bastante útiles, algunas son costosas y requieren de mucha infraestructura para poder ser implementadas. Es por eso que en este post te presento una pequeña librería útil como no te imaginas que permite crear y manipular documentos de Word (únicamente los `.docx`) **sin tener instalado Office**.  \n  \nEn esta ocasión mostraré cómo crear un reporte de las clases (`lectures`) que imparte un determinado maestro (`teacher`), con la información que usé en el <a href=\"http://thatcsharpguy.com/post/linq-en-c-sharp-3/\">post sobre LINQ en C#</a>:  \n\n## Creando un documento\nPara crear un documento es necesario utilizar el método estático `Create` especificando la ruta del archivo. La sentencia `using` es importante para asegurarnos que cuando terminemos de usar el documento, se liberen sus recursos de manera adecuada:  \n\n{% highlight csharp %} \nusing (var document = DocX.Create(\"Prueba.docx\"))\n{\n    // Dentro de este bloque tenemos disponible el documento\n    // ...\n{% endhighlight %}\n\n## Guardando un documento  \nUna vez creado el documento y después de que hemos terminado de trabajar con él debemos guardar nuestros cambios, esto se hace mediante una llamada a su método `Save`, con lo cual todos los cambios hechos en el documento serán aplicados sobre el archivo. Es importante que llames al método dentro del bloque `using` (de otro modo obtendrás un error de compilación).  \n\n{% highlight csharp %}\n    // ...\n    document.Save();\n}\n{% endhighlight %}\n\nCabe señalar que también tenemos a nuestra disposición el método `SaveAs` que permite especificar una ruta distinta a la que usamos para crear nuestro documento.  \n  \nSi ejecutamos el código hasta este momento veremos un documento vacío llamado \"Prueba.docx\" en la carpeta donde está nuestra aplicación, en mi caso es dentro de `bin\\Debug`, y es porque al crear nuestro documento únicamente empleamos el nombre de un archivo.  \n  \n{% post_image created-document.png \"Documento vacío\" %}  \n\n## Añadiendo texto  \nEl texto dentro de un documento de DocX está organizado en párrafos, y por eso debemos añadir párrafos a nuestro documento, para ello debemos tomar nuestro documento y llamar el método `InsertParagraph`.  \n\n{% highlight csharp %}\nvar reportParagraph = document.InsertParagraph();\n{% endhighlight %}\n\nEl método devuelve una referencia al párrafo que añadió al documento, a partir de aquí podemos añadirle texto a dicho párrafo, y por ende, al documento. Para agregar texto debemos usar el método `Append` de la clase `Paragraph`, este método funciona de manera similar a un `StringBuilder` ya que podemos *\"encadenar\"* las llamadas para separar partes del código:  \n\n{% highlight csharp %}\nreportParagraph.Append(\"Este es un reporte perteneciente a las clases que imparte \" + teacher.GivenName + \" \" +\n                    teacher.LastName + \", generado en \" + DateTime.Now.ToShortDateString() + \". \")\n    .Append(\"El profesor/ra \" + teacher.LastName + \" imparte actualmente \" + lectures.Length + \" asignaturas.\");\n{% endhighlight %}  \n  \nHasta este momento, el resultado de ejecutar el código es un documento que contiene el texto arriba indicado, se ve más o menos así:  \n  \n{% post_image sin-estilo.png \"Documento sin estilo\" %}  \n\n### Formateando el texto  \nEl texto sin formato está bien, ¿pero sabes qué es mejor?  \n  \nDocX tiene una API peculiar para aplicar el formato, ya que todo es a través de métodos que se llaman sobre la instancia de `Pharagraph`. El formato deseado se aplica al texto que acaba de ser \"escrito\" con `Append`, por ejemplo:  \n\n{% highlight csharp %}\nreportParagraph.Append (\"Este es un reporte perteneciente a las clases que imparte \");\nreportParagraph.Append (teacher.GivenName + \" \" + teacher.LastName).Bold().Append(\", generado en \");\nreportParagraph.Append (DateTime.Now.ToShortDateString ()).Italic().Append (\". \")\n    .Append (\"El profesor/ra \").Append(teacher.LastName).Font(new FontFamily(\"Arial Black\"))\n    .Append(\" imparte actualmente \")\n    .Append(lectures.Length + \" asignaturas.\").Color(Color.Blue).Italic().Bold();\n{% endhighlight %}  \n\nEn el código de arriba están pasando varias cosas:  \n  \n - En la segunda línea se está poniendo el texto `teacher.GivenName + \" \" + teacher.LastName` en **negritas** con el método `Bold`  \n - En la tercera línea se pone en *cursiva* la fecha con `Italic` \n - En la cuarta se cambia la fuente del texto con el que se escribe apellido del profesor con `Font`\n - En la sexta se cambia el color del texto, se pone en cursivas y en negritas también.  \n \nObtenemos un resultado como este:   \n  \n{% post_image estilo.png \"Documento estilizado\" %}   \n\n \nAdemás de estas opciones de formato también podemos subrayar, cruzar, cambiar el tamaño del texto.\n\n## Títulos  \nUna de las mejores funciones que tiene Word es la posibilidad de añadir títulos a los documentos, y DocX no se queda atrás. Como ya vimos, es necesario añadir un párrafo, agregarle texto e indicarle qué tipo de encabezado deseamos  \n\n{% highlight csharp %}\nvar titleParagraph = document.InsertParagraph();\ntitleParagraph.Append(\"Reporte \" + LastName).Heading(HeadingType.Heading1);\n{% endhighlight %}  \n\nY acá está el resultado:  \n  \n{% post_image encabezado.png \"Encabezado\" %}  \n  \n## Encabezado y pie de página  \nPara darle un poco más de formalidad al documento, vamos a añadirle un pie de página y un encabezado, otra vez debemos añadir párrafos. Antes que nada, es necesario llamar a dos métodos para preparar el terreno.\n\n{% highlight csharp %}\ndocument.AddHeaders();\ndocument.AddFooters();\n{% endhighlight %}  \n\nUna vez hecho esto, podemos comenzar:\n\n{% highlight csharp %}\nvar header = document.Headers.odd.InsertParagraph();\nheader.Append (\"Reporte - DocX\").Font(new FontFamily(\"Courier New\"));\n\ndocument.Footers.odd.PageNumbers = true;\n{% endhighlight %}  \n\nEn este caso estamos agregando el texto \"Reporte - DocX\" al encabezado y un número de página al pie de página:  \n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n{% post_image header.png \"Encabezado\" %}  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n{% post_image footer.png \"Pie de pagina\" %}  \n</div>  \n</div>  \n\n## Tablas\nLa inserción de tablas se hace también a través de un método y especificando el número de filas y columnas que se requieren, para este caso requeriremos únicamente 3 columnas y colocaremos una fila de encabezados, también le añadiremos un poco de estilos y bordes para que se vea mejor el \"reporte\":\n\n{% highlight csharp %}\nvar table = document.InsertTable (1, 3);\n\ntable.AutoFit = AutoFit.Window;\nvar border = new Border (BorderStyle.Tcbs_single, BorderSize.one, 0, Color.Black);\ntable.SetBorder (TableBorderType.InsideH, border); // ... más bordes\n{% endhighlight %}  \n\nDe ahí accedemos a la fila `0` y a sus celdas mediante la propiedad `Cells`, cada celda funciona como un nuevo documento, por lo que debemos trabajar con los párrafos como anteriormente:\n\n{% highlight csharp %}\nvar tableHeaders = table.Rows[0];\ntableHeaders.Cells[0].InsertParagraph().Append(\"ID\").Bold();\ntableHeaders.Cells[1].InsertParagraph().Append(\"Clase\").Bold();\ntableHeaders.Cells[2].InsertParagraph().Append(\"Nivel\").Bold();\n{% endhighlight %}  \n\nDespués con un ciclo sobre `lectures`, agregamos todos los datos:\n\n{% highlight csharp %}\nforeach (var lecture in lectures) \n{\n    var tableRow = table.InsertRow();\n    tableRow.Cells[0].InsertParagraph().Append (lecture.Id.ToString());\n    tableRow.Cells[1].InsertParagraph().Append(lecture.Name);\n    tableRow.Cells[2].InsertParagraph().Append(lecture.Level);\n}\n{% endhighlight %}  \n\nY el resultado:  \n\n{% post_image table.png \"Tabla\" %}  \n\nCon esto llegamos al final de la generación de nuestro reporte, pero antes hay que decir que DocX también permite trabajar con imágenes, hipervínculos, propiedades del documento.  \n\n# Buscar y reemplazar  \nPersonalmente pienso que la posibilidad de DocX de buscar y reemplazar texto en un documento es la mejor de todas, ya que podemos partir de un documento formateado a nuestro gusto (sin necesidad de crearlo desde 0) y obtener un resultado más que aceptable. Con esta característica construí una especie de \"motor\" para generar reportes en el trabajo.  \n \nPor ejemplo, tenemos un documento llamado `template.docx`, lo abriremos con DocX usando el método `Load` y reemplazaremos algunos de sus valores para guardarlo como `out.docx`:\n\n{% post_image template.png \"Template\" %}\n\n{% highlight csharp %}\ntemplate.ReplaceText(\"esta entrada\", \"este post sobre DocX\");\ntemplate.ReplaceText(\"querido\", \"querido y respetable\");\ntemplate.ReplaceText(\"Facebook\", \"Twitter\");\ntemplate.ReplaceText(\"correo electrónico\", \"feregrino@thatcsharpguy.com\");\n{% endhighlight %}      \n        \n{% post_image out.png \"Salida\" %}        \n\n## Conclusión  \nAl principio la API de DocX nos puede parecer un poco rara y con poca documentación, sin embargo, eso no le resta a lo enormemente útil que resulta esta librería, cuando lo que buscamos es trabajar y generar documentos de Word de manera programática. Lo mejor de todo es que **no requiere que la máquina en donde se ejecuta tenga instalado Office**, gran, gran plus.\n \n# Instalación  \nNo olvides visitar <a href=\"http://docx.codeplex.com\" target=\"_blank\">la página de DocX en Codeplex</a> o instala el paquete de NuGet en tu proyecto:\n\n{% console titulo %}\nPM> Install-Package DocX\n{% endconsole %}\n"
}