{	
	"id" : "/post/atributos-c-sharp/",
	"tv" : false,
	"date": "2016-09-12 14:00:01 -0500",
	"title" : "Xamarin.Auth",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//aprende-c-sharp/attrs/featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>Hace tiempo contaba sobre las <a href=\"../directivas-preprocesador-c-sharp\">directivas de preprocesador</a>, que no son más que <strong>una forma de interactuar con las herramientas que compilan tu código</strong>. Sin embargo, no es la única manera que tenemos para lograr esta tarea en C#, otra forma de hacerlo es a través de los <em>Atributos</em>.</p>\n\n<p>Los atributos en C# no son más que una forma de agregarle información extra (metadatos) a nuestro código. Por poner un ejemplo, podemos usar un atributo para indicar que determinado método es obsoleto (<code>ObsoleteAttribute</code>) y no debe seguir usándose. Con otro atributo podemos indicarle a nuestro programa que determinada propiedad en un objeto es requerida (<code>RequiredAttribute</code>) o que el valor que esperamos es un correo electrónico (<code>EmailAddressAttribute</code>).</p>\n\n<h2 id=\"uso\">Uso</h2>\n\n<p>Su sintaxis es un poco extraña, ya que a pesar de que un atributo no es más que una clase, generalmente no se instancía con el operador <code>new</code>, sino a través de los corchetes cuadrados <code>[]</code> y justo sobre la declaración de un método un método o tipo de dato, junto a un parámetro, o un ensamblado:</p>\n\n<pre class=\"csharp\">\n[ObsoleteAttribute(\"Esta clase es obsoleta, prueba con iPhone 6 o Galaxy S6\")]\npublic class Nokia3310\n\n    [RangeAttribute(0.0,9990.99, ErrorMessage = \"Wrong balance, must be between 1 and 2\")]\n    public double Balance  get; set; \n    \n    [Obsolete]\n    public void Call(string number, [CallerMemberName]string whoIsCalling = null)\n    \n        Console.WriteLine(whoIsCalling + \" is calling \" + number);\n    \n    // ...\n</pre>\n\n<p>Como puedes observar, en el código anterior existen 4 declaraciones de atributos: dos <code>ObsoleteAttribute</code>, un <code>CallerMemberNameAttribute</code> y un <code>RangeAttribute</code>. Antes de continuar, hay dos cosas a notar:  La primera es que no es necesaario escribir el nombre completo del atributo, tanto el nombre completo, como el nombre sin el sufijo “Attribute” son válidos para ser usados. Y la segunda es que los atributos también pueden recibir parámetros a través de su constructor.</p>\n\n<p>Como podrás ver, debido a su naturaleza declarativa, los atributos resultan ser algo muy legible para los programadores. A primera instancia podemos ver que tanto la clase <code>Nokia3310</code> como su método <code>Call</code> son obsoletos, que la propiedad <code>Balance</code> únicamente debe aceptar números entre 0 y 9990.99. Y que de no ser provisto, el valor de <code>whoIsCalling</code> será el nombre del miembro que <a href=\"ttps://msdn.microsoft.com/en-us/library/system.runtime.compilerservices.callermembernameattribute(v=vs.110).aspx#mainBody\" target=\"_blank\">llamó a la ejecución del método</a>.</p>\n\n<h3 id=\"en-funcionamiento\">En funcionamiento</h3>\n\n<p>Pero su utilidad no termina ahí, si estamos desarrollando en Visual Studio, cuando deseemos usar la clase <code>NoKia3310</code>, el IDE nos informará sobre la obsolecencia de la clase o sus métodos:</p>\n\n<p>post_image vs.png “Capture”</p>\n\n<p>Y si luego ejecutamos un programa que lo use:</p>\n\n<p>post_image capture.png “Capture”</p>\n\n<h2 id=\"parmetros\">Parámetros</h2>\n\n<p>Pero volvamos a los parámetros que reciben algunos atributos, los cuales son recibidos a través del constructor. Estos parámetros pueden categorizarse en dos grupos:</p>\n\n<ul>\n  <li>Posicionales. Que para ser asignados correctamente requieren de ser declarados en el constructor, y cuando se especifican deben aparecer en la posición exacta en la que fueron colocados.</li>\n  <li>Nombrados. Que para ser asignados deben llevar antepuestos el nombre de la propiedad a la que se van a asignar. Estos no deben aparecer en el constructor.</li>\n</ul>\n\n<p>En el caso de la primera declaración de <code>Obsolete</code> en el código anterior, estamos haciendo uso de un parámetro posicional, que representa el mensaje a mostrar cuando se presente la advertencia de miembro obsoleto. Mientras que en el caso de la declaración de <code>Range</code>, estamos haciendo uso de los parámetros tanto posicionales (los valores mínimo y máximo) como de parámetros nombrados (<code>ErrorMessage</code>).</p>\n\n<h3 id=\"atributos-famosos\">Atributos “famosos”</h3>\n<p>Los atributos son usados en diversas partes del framework de .NET, y no cabde duda que en algún momento te haz o te habrás de encontrar con alguno, entre los que más me he encontrado yo están:</p>\n\n<ul>\n  <li><code>Obsolete</code>.</li>\n  <li><code>Flags</code>, que expliqué en <a href=\"../c-sharp-enums\" target=\"_blank\">el post sobre <code>enum</code></a>.</li>\n  <li><code>JsonProperty</code> y los que se usan para la <a href=\"http://www.newtonsoft.com/json\" target=\"_blank\">serialización en JSON</a>.</li>\n  <li><code>XmlElement</code> y los que se usan para la <a href=\"https://msdn.microsoft.com/es-es/library/system.xml.serialization.xmlelementattribute(v=vs.110).aspx\" target=\"_blank\">serialización XML</a>.</li>\n  <li><code>Required</code> y todos los contenidos en el <a href=\"https://msdn.microsoft.com/en-us/library/dd901590(VS.95).aspx\" target=\"_blank\"><em>namespace</em> DataAnnotations</a>.</li>\n  <li><code>HttpPost</code>, get, put… y todos los demás que especifican los <a href=\"https://docs.asp.net/projects/api/en/latest/autoapi/Microsoft/AspNetCore/Mvc/HttpPostAttribute/\" target=\"_blank\">verbos HTTP en Web API</a>.</li>\n</ul>\n\n<h2 id=\"creacin\">Creación</h2>\n<p>Una vez que ya conocemos un poco del uso y funcionalidad de los atributos en C#, tal vez valga la pena saber cómo es que podemos crear nuestros propios atributos para que nosotros (o nuestro equipo de trabajo) se beneficie con ellos. Para este ejemplo vamos a crear un atributo para validar la compañia con la que un teléfono funciona.</p>\n\n<h3 id=\"nombre\">Nombre</h3>\n<p>A peser de que el nombre no necesariamente debe tener la palabra “Attribute” (nuestra clase podría llamarse <code>ValidCarrier</code>), aunque es una convención que lo lleve. Por estas convenciones, nosotros le pondremos como nombre <code>ValidCarrierAttribute</code>.</p>\n\n<h3 id=\"derivar-de-la-clase-attribute\">Derivar de la clase Attribute</h3>\n<p>Este es sin duda el paso más importante, tu atributo debe derivar de la clase <code>Attribute</code>, en nuestro caso estaremos derivando de la clase <code>ValidationAttribute</code> que ya tiene como clase base a <code>Attribute</code>:</p>\n\n<pre class=\"csharp\">\npublic class ValidCarrierAttribute : ValidationAttribute\n\n    // ...\n</pre>\n\n<h3 id=\"especificar-su-objetivo\">Especificar su objetivo</h3>\n<p>Una vez especificado el nombre del atributo y su relación con la clase base, es momento de especificar su objetivo. El objetivo de un atributo se refiere a en qué parte del código puede ser utilizado, para hacerlo es necesario utilizar el atributo <code>AttributeUsage</code>, que recibe como parámeto una combinación de valores del <em>enum</em> <code>AttributeTargets</code>. En nuestro caso, queremos aplicarlo únicamente a las propiedades de un tipo, por lo tanto usaremos únicamente <code>AttributeTargets.Property</code> (la lista completa en <a href=\"https://msdn.microsoft.com/en-us/library/system.attributetargets(v=vs.110).aspx\" target=\"_blank\">este enlace</a>):</p>\n\n<pre class=\"csharp\">\n[AttributeUsage(AttributeTargets.Property)]\npublic class ValidCarrierAttribute : ValidationAttribute\n// ...\n</pre>\n\n<h3 id=\"parmetros-1\">Parámetros</h3>\n<p>Si tu atributo requiere recibir parámetros, debes declararlos en el constructor del atributo. En nuestro caso, recibiremos una cadena de texto que indicará las compañías con las que funciona, así como un parámetro que indica si se permite que un teléfono funcione con más de una compañía a la vez:</p>\n\n<pre class=\"csharp\">\n//\t\t\t   Positional parameter vvvvvvvvvvvvv\npublic ValidCarrierAttribute(string validCarriers)\n\n    _validCarriers = validCarriers;\n\n\n// Named parameter \n//          vvvvvvvvvvvvvvvv\npublic bool MultipleCarriers  get; set; \n</pre>\n\n<h4 id=\"especificar-la-funcionalidad\">Especificar la funcionalidad</h4>\n<p>En este caso, en el que estamos derivando de <code>ValidationAttribute</code> debemos sobreescribir el método <code>IsValid</code>, puedes revisar la implementación aquí.</p>\n\n<h3 id=\"uso-1\">Uso</h3>\n<p>Ahora sí, podemos usarlo en nuestras clases:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\npublic class IPhone\n\n    [ValidCarrier(\"Vodafone,Telcel,AT&amp;T\", \n        MultipleCarriers = true)]\n    public string Carrier  get; set; \n\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\npublic class Galaxy\n\n    [ValidCarrier(\"Vodafone,Movistar,Sprint\")]\n    public string Carrier  get; set;   \n    \n\n</pre>  \n</div>  \n</div>\n\n<p>Y lo podemos probar en nuestro código de la siguiente manera:</p>\n\n<pre class=\"csharp\">\nvar iPhone = new IPhone();\niPhone.Carrier = \"Telcel,AT&amp;T\";\n\nvar iPhoneContext = new ValidationContext(iPhone, serviceProvider: null, items: null);\n\nif (Validator.TryValidateObject(iPhone, iPhoneContext, phoneResults, true))\n    Console.WriteLine(\"Tu iPhone es válido\");\nelse \n    Console.WriteLine(\"Tu iPhone es inválido\");\n\nvar galaxy = new Galaxy();\ngalaxy.Carrier = \"Sprint,Movistar\";\n\nvar galaxyContext = new ValidationContext(galaxy, serviceProvider: null, items: null);\n\nif (Validator.TryValidateObject(galaxy, galaxyContext, phoneResults, true))\n    Console.WriteLine(\"Tu Galaxy es válido\");\nelse\n    Console.WriteLine(\"Tu Galaxy es inválido\");\n</pre>\n\n<p>El resultado de ejecutar el código anterior es el siguiente:</p>\n\n<pre>\n= Custom attributes  \nTu iPhone es válido  \nTu Galaxy es inválido  \n</pre>\n\n<p>En este ejemplo hacemos uso de todas las prestaciones que nos da la clase <code>ValidationAttribute</code>, aunque también pudimos haber creado un atributo desde cero, aunque para usarlo debemos conocer temas un poco más avanzados, como la reflexión o el uso de <em>Roslyn</em>.</p>\n\n<h2 id=\"para-terminar\">Para terminar</h2>\n\n<p>Eso es todo por este post, como puedes ver, los atributos sirven para una gran variedad de cosas: desde modificar el comportamiento del compilador hasta hacernos más sencillo el proceso de validación de datos en nuestras aplicaciones. A pesar de que su sintaxis es un poco diferente a lo que estamos acostumbrados en C#, no son difíciles de emplear y crear. Te invito a <a href=\"https://github.com/ThatCSharpGuy/aprende-c-sharp/tree/master/Attributes\" target=\"_blank\">descargar el código de este ejemplo</a>, y si tienes dudas, me las hagas llegar.</p>\n"
}