{	
	"id" : "/post/code-organization-visual-studio/",
	"tv" : false,
	"date": "2015-11-16 15:00:00 -0600",
	"title" : "How is my code organized in Visual Studio?",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimagesfeatured.jpg",
	"tags" :
	["VisualStudio","Xamarin"],
	
	"content" : body"If you have ever used an IDE to develop any application you might have wondered how do these kind of programs know where are the components for each one of the things that make your app compile or run. In this post I'll try to explain how Xamarin Studio and Visual Studio keeps that control.\n\n### The Solution\nBoth Visual Studio and Xamarin Studio organize our code, assets, libraries and other stuff in a structure called *Solution*, all this information is stored within a file with extension **.sln**. The **.sln** file is an (usually) automatically generated plain text file that tells the IDE where to find the projects related to our application.\n\n{% post_image solution-in-folder.png \"Image of a solution file\" %}\n\nThis is how a Solution (the free C#/F# shirt app solution) looks like when opened in Xamarin Studio and Visual Studio:\n\n{% post_image sln-opened.png \"Image of opened solutions\" %}\n\nAnd this is how a the same file looks like when opened in a plain text editor.\n\n{% post_image sln-plain-text-explained-2.png \"Image of opened solutions\" %}\n\n<dl>\n<dt>1. Solution</dt>\n<dd>The file itself, the name we see in the IDE is the same name of the file plus the <code>.sln</code> extension.</dd>\n<dt>2. Solution folder</dt>\n<dd>These are logical folders that we can use to organize our solution.</dd>\n<dt>3. Shared project</dt>\n<dd>A shared project (we'll talk about them on a later post).</dd>\n<dt>4. C# project</dt>\n<dd>A C# project, in this case refers to an Android project, in Xamarin is a convention to use the <code>.Droid</code> suffix to denote that.</dd>\n<dt>5. C# project</dt>\n<dd>Another C# project, in this case refers to an iOS project, in Xamarin is a convention to use the <code>.iOS</code> suffix to denote that.</dd>\n</dl>\n\n\n### The .[something]proj file\n\nAs I mentioned above, the Solution keeps track of the projects that comprise our application, but what is exactly a project?\n\nWell, a Project is a logical way to organize a project's files (classes, resources, images...) it is described in a file ending with `proj`, being `.csproj` for C# projects, `.shproj` for shared, other kind of projects end in `.vbproj`, `.jsproj`, etc.\n\nAs you can see in the previous image, the `.sln` file contains \"links\" to these projects.\n\nThese are the projects for the Free Xamarin Shirt App:\n\n{% post_image freeshirtappproject.png \"Xamarin Free Shirt App\" %}\n\n### tl;dr\nWe can explain how is our code organized with a simple diagram. \n\n{% post_image Solution-diagram.jpg \"Diagram of how solution works\" %}\n"
}