{	
	"id" : "/post/code-snippets-visual-studio/",
	"tv" : false,
	"date": "2016-02-22 04:00:00 -0600",
	"title" : "Code Snippets en Visual Studio",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/code-snippets/featured.png",
	"tags" : ["VisualStudio"],
	"content": "<p>Los <em>code snippets</em>, o, <strong>fragmentos de código</strong>, son otra de las grandes prestaciones que nos ofrece el entorno de desarrollo Visual Studio, conocerlos y usarlos, puede ayudarnos a la hora de desarrollar. En este post hablaré de ellos: ¿qué son y cómo funcionan? ¿cuáles tiene VS instalados? y cómo crear tus propios fragmentos.</p>\n\n<h3 id=\"qu-son\">¿Qué son?</h3>\n<p>Pues como su nombre lo indica son fragmentos de código son “pequeñas” porciones de código que podemos reutilizar una y otra vez dentro de los archivos de código de nuestra aplicación, todo esto se hace en al momento de escribir el código y nada tiene que ver con alguna característica de C#.</p>\n\n<p>Estos fragmentos de código se cargan de un directorio cuando arranca Visual, y podemos acceder a ellos a través de un menú contextual o aprovechar una de las ventajas de los <em>snippets</em>, la cual nos permite acceder a ellos a través de una especie de “palabra reservada” o atajo y la tecla <kbd>tab</kbd>.</p>\n\n<h4 id=\"funcionamiento\">Funcionamiento</h4>\n<p>Su funcionamiento es sencillo, mientras estamos editando escribimos el atajo y presionamos dos veces la tecla <kbd>tab</kbd>, tras lo cual como por arte de magia aparecerá el fragmento de código completo:</p>\n\n<p>post_image cw.gif “Console.WriteLine snippet”</p>\n\n<p>En este caso, si revisas bien, el atajo usado fue <code>cw</code>, que podríamos interpretar como la <code>C</code> de <code>Console</code> y la <code>w</code> de <code>WriteLine</code>, el hecho de que sea así solo es una coincidencia o un gran acierto del creado, pero no es necesario que el atajo tenga que ver con el código que genera, más adelante, cuando veamos cómo crear tus propios fragmentos, verás por qué lo digo.</p>\n\n<p>También hay fragmentos de código que contienen partes editables dentro de ellos, de tal manera que podamos personalizarlo con el contexto de la aplicación que estamos desarrollando. Por ejemplo, mira este:</p>\n\n<p>post_image prop.gif “Prop”</p>\n\n<p>El atajo usado fue <code>prop</code> y una vez insertado, señaló dos partes del código a las cuales accedemos presionando <kbd>tab</kbd> nuevamente, en este caso permite editar el tipo de la propiedad y su nombre, para finalizar la edición presionamos enter.</p>\n\n<h3 id=\"snippets-de-visual-studio\">Snippets de Visual Studio</h3>\n<p>Apenas terminas de instalar VS puedes comenzar a usar los fragmentos que trae por default, para C# son aproximadamente unos 35.</p>\n\n<p>En <a href=\"https://msdn.microsoft.com/en-us/en-en/library/z41h7fat.aspx\" rel=\"nofoloww\" target=\"_blank\">este enlace</a> está la lista entera, pero la siguiente es una lista de los que yo uso más:</p>\n\n<ul>\n  <li><code>#region</code> que podemos usar para crear una agrupación física de líneas de código en nuestro archivo</li>\n</ul>\n\n<p>post_image region.gif “Region directive”</p>\n\n<ul>\n  <li><code>ctor</code> que se usa para crear un constructor de la clase en la que se declara</li>\n</ul>\n\n<p>post_image ctor.gif “Constructor”</p>\n\n<ul>\n  <li><code>for</code> crea un ciclo for con valores editables para la variable de iteración y sobre la que se va a comprobar el ciclo</li>\n</ul>\n\n<p>post_image for.gif “Constructor”</p>\n\n<ul>\n  <li><code>foreach</code> crea un ciclo “para cada”, nos permite editar el tipo de dato y los nombres de los objetos</li>\n</ul>\n\n<p>post_image foreach.gif “Constructor”</p>\n\n<ul>\n  <li>\n    <p><code>prop</code> que crea una propiedad autoimplementada</p>\n  </li>\n  <li>\n    <p><code>propg</code> que crea una propiedad autoimplementada que únicamente define un <em>getter</em></p>\n  </li>\n  <li>\n    <p><code>propfull</code> que crea una propiedad con su respectivo campo de respaldo</p>\n  </li>\n</ul>\n\n<p>Si ya usas los fragmentos seguramente coincidiremos en algunos, y si no, cuando los empieces a usar, me cuentas.</p>\n\n<h3 id=\"creando-fragmentos\">Creando fragmentos</h3>\n<p>¿Qué sería de un IDE si no pudieramos personalizarlo? con VS podemos crear fragmentos para usarlos e inclusive compartirlos con nuestros amigos o compañeros de trabajo.</p>\n\n<p>Primero que nada, los fragmentos se almacenan en archivos con extensión <code>.snippet</code> (que por dentro son XML). Y a pesar de que existen algunas extensiones que permiten manipularlos, para mi siempre ha sido mejor editarlos manualmente.</p>\n\n<p>El lugar por default en donde debes colocar tus snippets es dentro de la carpeta <code>\\Documents\\Visual Studio 20[XX]\\Code Snippets\\[Lenguaje]\\My Code Snippets</code>.</p>\n\n<p>Bien, ahora que sabemos esto, vamos a crear un <em>snippet</em>, descarga <a target=\"_blank\" rel=\"nofollow\" href=\"https://raw.githubusercontent.com/fferegrino/fantastic-broccoli/master/sample.snippet\">este archivo</a> (clic derecho, guardar cómo), este archivo contiene una plantilla para lograr al menos algo básico, ábrelo con tue editor de texto o XML favorito, yo uso <a href=\"https://notepad-plus-plus.org/\" target=\"_blank\">Notepad++</a> y revisa su contenido.</p>\n\n<p>Es sencillo como puedes ver, las partes esenciales son:</p>\n\n<ul>\n  <li><code>Header</code> en donde va el título, el autor, la descripción y el atajo.</li>\n  <li><code>Snippet</code> en donde va el código que queremos que se inserte en el documento.</li>\n</ul>\n\n<p>Reemplaza los valores como desees, y no olvides poner tu código dentro de <code>&lt;![CDATA[</code> y <code>]]&gt;</code>, mira, este es el que yo he creado:</p>\n\n<pre class=\"xml\">\n<codesnippet format=\"1.0.0\">\n    <header>\n        <title>I love C# snippet</title>\n        <author>Antonio Feregrino</author>\n        <description>Tells the world you love C#</description>\n        <shortcut>love</shortcut>\n    </header>\n    <snippet>\n        <code language=\"CSharp\">\n            &lt;![CDATA[Console.WriteLine(\"I love C#\");]]&gt;\n        </code>\n    </snippet>\n</codesnippet>\n</pre>\n\n<p>Es hora de copiarlo en el directorio desde el que serán cargados e iniciar Visual Studio (hasta el día de hoy sigue siendo necesario reiniciar el IDE cada vez que cambiamos un <em>snippet</em>).</p>\n\n<p>Entonces al escribir en un archivo de código C# el atajo <code>love</code> y presionar <kbd>tab</kbd> <kbd>tab</kbd>, sucede esto:</p>\n\n<p>post_image love.gif “I love C#”</p>\n\n<p>Vamos a crear algo un poco más complejo, algo que permita reemplazar valores dentro del fragmento de código, como el caso de <code>prop</code>, para realizar la tarea puedes seguir trabajando con el archivo que tienes, o <a target=\"_blank\" rel=\"nofollow\" href=\"https://raw.githubusercontent.com/fferegrino/fantastic-broccoli/master/sample-2.snippet\">descargar este otro</a>.</p>\n\n<p>Lo importante es añadir un hijo llamado <code>Declarations</code> como hijo de <code>Snippet</code>. Dentro de <code>Declarations</code> es donde debemos definir los reemplazos que vamos a necesitar. Existen dos tipos de reemplazos <code>Literal</code> y <code>Object</code>, por ahora vamos a quedarnos solo con <code>Literal</code>, así que añade un elemento d este tipo dentro de <code>Declarations</code>, a su vez, <code>Literal</code> debe tener como hijos los elementos <code>ID</code> y <code>Default</code>. Suena bastante complicado… y por eso pongo un ejemplo de lo que digo:</p>\n\n<pre class=\"xml\">\n<codesnippet format=\"1.0.0\">\n    <header>\n        <title>I love ?? snippet</title>\n        <author>Antonio Feregrino</author>\n        <description>Tells the world you love something</description>\n        <shortcut>lovesth</shortcut>\n    </header>\n    <snippet>\n        <declarations>\n            <literal>\n                <id>something</id>\n                <default>C#</default>\n            </literal>\n        </declarations>\n        <code language=\"CSharp\">\n            &lt;![CDATA[Console.WriteLine(\"I love $something$\");]]&gt;\n        </code>\n    </snippet>\n</codesnippet>\n</pre>\n\n<p>Como puedes ver, dentro del código del fragmento está el <code>ID</code> que puse dentro de la declaración del reemplazo, la novedad es que el ID está delimitado por <code>$</code> lo cual indica que es un valor que será reemplazado.</p>\n\n<p>post_image lovesth.gif “I love other things”</p>\n\n<h5 id=\"cambiando-la-ruta-de-los-fragmentos\">Cambiando la ruta de los fragmentos</h5>\n<p>Si lo que quieres es cambiar la ruta de tus fragmentos a otra carpeta dentro de tu PC, puedes acceder al Administrador de Fragmentos de Código que está en el menú Herramientas, dar clic en Añadir y seleccionar la carpeta de la que deseas que se carguen los fragmentos. En mi caso, lo tengo configurado de esa manera porque uso GitHub para sincronizar algunos de los fragmentos que uso, si quieres verlos, <a href=\"https://github.com/fferegrino/fantastic-broccoli\" target=\"_blank\">visita el repositorio</a>.</p>\n\n<h3 id=\"ventajas\">Ventajas</h3>\n<p>La ventaja de los <em>snippets</em> va más allá del ahorro de tiempo que introduce en nuestro proceso de desarrollo, y esto lo digo porque tal vez la ventaja de escribir un if completo o usar el <em>snippet</em> no sea tan significativa. Si no el simple hecho de liberar nuestras mentes de colocar el cursor en la posición correcta o de cerrar correctamente los corchetes, es en sí, la gran ventaja de estos.</p>\n\n<p>Además de que a través de los <em>snippets</em> se puede implementar un <a href=\"/post/importancia-de-programar-con-estilo\">estilo de programación</a> dentro de la organización en la que trabajamos, imagínate que todos usan los mismos fragmentos para programar, seguramente las diferencias entre el código de un programador y otro se disminuirían.</p>\n\n<h3 id=\"desventajas\">Desventajas</h3>\n<p>(…) La única desventaja real que existe es que podríamos acostumbrarnos a usarlos y que cuando no los tengamos nos costará un poco de trabajo programar sin ellos… pero vamos, que todos los IDE que son comúnmente usados para programar en .NET tienen soporte para fragmentos de código.</p>\n"
}