{	
	"id" : "/post/tipos-nullables-en-c-sharp/",
	"tv" : false,
	"date": "2015-10-14 15:30:00 -0500",
	"title" : "Tipos nullables en C#",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/tipos-nullables-en-c-sharp/featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>En un post anterior hablaba acerca de los tipos de dato en C#, y me doy cuenta que se me olvidó mencionar una característica importante de los tipos de dato, y para rectificar mi error voy a tomar la clasificación por referencia y valor de la que les platicaba.</p>\n\n<h3 id=\"apuntando-a-la-nada\">Apuntando a la nada</h3>\n\n<p>Los tipos por referencia son <em>nullables</em> por definición. ¿Qué implica que sean <em>nullables</em>? pues nada más y nada menos que puedan tener un valor <code>null</code> o en términos prácticos, nungún valor. Esto se puede explicar desde el nombre mismo, al ser referencias estas <strong>pueden estar referenciando a un valor o a la nada</strong> (a <code>null</code>).</p>\n\n<p>Por otro lado, los <strong>tipos por valor siempre tienen un valor</strong> (valga la redundancia) asignado. Es así que un <code>int</code>, <code>bool</code>, <code>double</code>, etcétera nunca podrán valer <em>null</em>. Y es que estos no hacen referencia a ningún valor, sino que son el valor mismo.</p>\n\n<p>Muchas veces esta limitante nos lleva a inventarnos <em>números mágicos</em> como por ejemplo usar el <code>-1</code> para decir que un entero no tiene valor, o lógicas extrañas dentro de nuestro programa como decir que si un <code>DateTime</code> vale <code>DateTime.MinValue</code> es porque no tiene valor.  También nos complica un poco la vida cuando se trabaja con bases de datos en donde los datos pueden tener un valor o estar indefinidos.</p>\n\n<h3 id=\"la-estructura-nullablelttgt\">La estructura Nullable&lt;T&gt;</h3>\n<p>Para nuestra fortuna, C# nos ofrece los <em>nullable types</em>, que son instancias de la estructura <code>Nullable&lt;T&gt;</code> (si no estás familiarizado con la sintaxis <code>&lt;&gt;</code> pronto la explicaré en un post, es maravillosa), donde <code>T</code> es un tipo por valor.</p>\n\n<p>Podemos ver esta estructura como una especie de caja para nuestros tipos por valor, dicha caja provee métodos para saber si contiene un valor y obtener el valor que contiene.</p>\n\n<h4 id=\"trabajando-con-nullablelttgt\">Trabajando con Nullable&lt;T&gt;</h4>\n<p>La sintaxis de estos tipos no es muy complicada, y es que además de la declaración convencional:</p>\n<pre class=\"csharp\">\nNullable<int> enteroNullable = null;\nNullable<double> puedeValerNull = 9.9;\n\nTambién podemos usar el símbolo (<code>?</code>) en la declaración de la variable para indicar que se trata de un tipo nullable:  \n<pre class=\"csharp\">\nint? enteroNullable = null;\ndouble? puedeValerNull = 9.9;\n</pre>\nAunque en este punto debemos ser cuidadosos, ya que la sintaxis es un poco confusa, ya sabemos, <code>Nullable</code> es una estructura y las estructuras no pueden tener un valor `null`...  ¿entonces qué sucede al momento de asignar un valor a `enteroNullable` en  el código anterior?  \nComo dije anteriormente, los tipos nullables son como una caja, al asignarle <code>null</code> estamos creando una caja que puede contener un <code>int</code> pero que al momento estamos dejando vacía. Podemos entonces trabajar con nuestra variable:  \n\n\n post_image boxes.png Tipos por valor \n\n##### Obteniendo un el valor (o una excepción)  \nPara obtener el valor contenido dentro de un *nullable*, tenemos a nuestra disposición la propiedad <code>Value</code>, que debemos usar con cuidado, puesto que en caso de que el *nullable* no tenga un valor asignado, lanzará una exepción del tipo `InvalidOperationException`. \n<pre class=\"csharp\">\nenteroNullable = null;\n// int enteroExcepcional = enteroNullable.Value; \n// Este código lanza una excepcion ^\n\nenteroNullable = 5;\nint sinExcepciones = enteroNullable.Value;\n</pre>    \n\n##### Comprobando si tiene un valor  \nSi lo que queremos es evitarnos manejar exepciones, conocer si nuestra variable tiene un valor asignado con la propiedad `HasValue` \n<pre class=\"csharp\">\nif(enteroNullable.HasValue)\n\n\tConsole.WriteLine(\"La caja está llena\");\n\nelse \n\n\tConsole.WriteLine(\"La caja está vacía :(\");\n\n</pre>    \n  \n##### Obteniendo un valor por default  \nSi lo que de verdad nos interesa es obtener un valor de nuestra variable, podemos usar `GetValueOrDefaut`, que es un método que podemos usar para asegurarnos que no nos encontraremos con una exepción al consultar el valor. Lo que nos devolverá el método es:  \n  \n - El valor contenido dentro del *nullable*, si tiene alguno\n - El valor por default del tipo de nuestro *nullable*, si este no tiene alguno o el valor que usemos como parámetro en nuestro método `GetValueOrDefaut`.\n \n<pre class=\"csharp\">\nenteroNullable = null;\n\nint defaultValue = enteroNullable.GetValueOrDefault();\n// defaultValue == 0\n\nint noTanDefaultValue = enteroNullable.GetValueOrDefault(8);\n// noTanDefaultValue == 8\n\nenteroNullable = 100; // Le asignamos un valor a la variable\nint realValue = enteroNullable.GetValueOrDefault();\n// realValue == 100\n</pre>      \n  \n<br />\nAhora sí: en futuros post seguré explorando algunos detalles escenciales de C#, como arreglos, métodos y clases.\n\n</double></int></pre>\n"
}