{	
	"id" : "/post/ser-xamarin-student-partner/",
	"tv" : false,
	"date": "2015-12-16 12:31:38 -0600",
	"title" : "Ser un Xamarin Student Partner",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimagesfeatured.png",
	"tags" :
	[ 
		"Meta"
	],
	"content" : "<p>Que yo les hable tanto de Xamarin en este blog no es obra de la casualidad, y es que formo parte de los primeros <em>Xamarin Student Partners</em>, un grupo formado a principios de 2015 al que pertenecen estudiantes interesados en difundir el desarrollo móvil multiplataforma en varias universidades al rededor del mundo. En este post, te cuento de mi experiencia hasta ahora.</p>

<p>Sin duda, si</p>

<ul>
  <li>Te gusta hacer aplicaciones en tu tiempo libre</li>
  <li>Tienes habilidades para comunicarte</li>
  <li>Publicas y contribuyes a código en GitHub</li>
  <li>Te gusta (o estás interesado) el desarrollo en C#</li>
  <li>Te gusta enseñar a otros</li>
  <li>(<strong>Plus</strong>) Tienes experiencia desarrollando para Android o iOS</li>
</ul>

<p>Disfrutaras todo del programa que Xamarin ofrece para estudiantes.</p>

<p>Por poner un ejemplo: A mi me encanta eso de enseñar (y aprender) de otros, y pertenecer a este grupo me provee de los recursos suficientes para hacerlo. Y cuando hablo de recursos no estoy diciéndolo a la ligera: Comenzando con una <strong>licencia tipo <em>Business</em></strong> que nos permite hacer y deshacer cuanto queramos en cuanto a cosas de Xamarin se refiere (incluyendo vender nuestras aplicaciones en las tiendas de apps).</p>

<p>Pero, <strong>¿para qué querríamos una licencia si no sabemos qué hacer con ella?</strong> Pues no te preocupes, porque además de la licencia, también tenemos acceso gratuito a la Xamarin University que bien le hace honor a su nombre puesto que es un lugar en donde puedes aprender a desarrollar aplicaciones con Xamarin.iOS, Xamarin.Android y con Xamarin.Forms. Pero la cosa no se queda ahí, además hay clases sobre testing, telemetría, C# y F#.</p>

<p>La cosa no se queda ahí, una vez que ya aprendiste todo lo que querías sobre la tecnología, también tienes la posibilidad de <strong>certificarte como <em>Xamarin Certified Developer</em></strong>, la cual es una certificación totalmente válida y avalada por la compañía misma. Todo gratis para nosotros.</p>

<p>Y bueno, <strong>estoy aprendiendo, pero también quiero enseñar</strong>. Genial, de eso se trata. Tienes el apoyo de la empresa tanto con recursos materiales con cosas para regalar (monitos, estampas, playeras…) entre los asistentes a tus pláticas y talleres, además de materiales digitales (diapositivas, código, documentación…) para prepararlos y llevarlos a cabo.</p>

<p>Además de aprender y enseñar, es importante <strong>compartir experiencias con otros <em>student partners</em> alrededor del mundo</strong> y esto se puede hacer gracias a la comunidad de Slack en donde estamos todos concentrados para platicar, hacer equipos y desarollar ideas. Y ni hablar de la posibilidad de asistir a eventos locales de Xamarin para compartir con aún más personas.</p>

<p>Todo esto y más (no hablé de las horas de <em>Test Cloud</em>) a cambio de hacer lo que te gusta: aprender y <strong>enseñar</strong> de una tecnología que te gusta. Honestamente no creo que exista un programa tan bueno para los estudiantes como este.</p>

<p>Si estás interesado pero no cumples con los requisitos, no te preocupes, algunas de esas son cosas que se pueden aprender sobre la marcha, y te resultará sencillo si en verdad te interesa, por lo pronto el <a href=\"https://xamarin.com/student#partners\" target=\"_blank\">registro está abierto para la nueva generación</a> de XSP que comenzará a principios de 2016. Si quieres algún consejo o tienes alguna duda no dudes en contactarme, a pesar de que soy solo un miembro más del programa, espero poder orientarte un poco.</p>
"
}