{	
	"id" : "/post/of-xamarin-netduino-iot/",
	"tv" : false,
	"date": "2015-08-07 13:31:38 -0500",
	"title" : "Of Xamarin, Netduino and IoT",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/of-xamarin-netduino-iot/featured.jpg",
	"tags" : ["Xamarin","Netduino"],
	"content": "<p>I want to start this post by telling you how far is the light switch in my bedroom from my bed: <strong>VERY FAR</strong>. Sometimes I'm all tired, lying in my bed thinking \"wouldn't it be awesome if I could control that switch from here?\", of course I can always use a broom stick or something like that, but when you have other options this kind of posts are born.</p>\n<p>Now, the actual post: I decided to create an app to easily turn on or off my bedroom's light not only from my Windows Phone but from my iPod or any other device in my house. I'll try to explain how I did it.</p> \n\n<h3>Server (Netduino)</h3>\n<p>The system consists of two parts: Server and client. The server will be responsible of controlling the lightswitch and of always be listening for incoming requests.</p>\n<br />\n<br />\n<p>Speaking of hardware, I used a Netduino Plus 2, a <a href=\"http://www.seeedstudio.com/depot/Grove-Relay-p-769.html\" target=\"_blank\">Groove Relay</a> (to handle high voltages), some resistors and of course wire. I won't dig a lot on the wiring but if you want I could help you with that, just ask.</p>\n<p>Speaking of software, this is really a simple app, I created a class that works as an interface, it abstracts the usage of stream sockets. Taking advantage of the multithreading capabilities of the NetMF I created  thread in which a socket is always waiting for incoming connections, and when one arrives reads two bytes from it, the first one contains the operation to be performed and the second one contains data when is a writing operation. I make use of delegates to get or set the light switch status from the main thread.</p>\n\n<pre class=\"csharp\">\nbyte[] data = new byte[2];\nwhile (true)\n\n    using (Socket client = server.Accept())\n    \n        client.Receive(data, 0, 2, SocketFlags.None);\n        if (((char)data[0]) == WriteLightSwitchState)\n        \n            if (OnLampStatusChangeRequest != null)\n            \n                OnLampStatusChangeRequest(this, new BooleanEventArgs(((char)data[1]) == ByteTrue));\n            \n        \n        else if (((char)data[0]) == ReadLightSwitchState)\n        \n            var args = new BooleanEventArgs(false);\n            if (OnLampStateRequest != null)\n            \n                // Using the delegate we should tell the app whether the switch is on or off\n                OnLampStateRequest(this, args);\n            \n            data[0] = args.Data ? ByteTrue : ByteFalse;\n            client.Send(data, 0, 1, SocketFlags.None);\n        \n    \n\n</pre>\n\n<h3>Client (Xamarin.Forms app)</h3>\n<p>The client only has a single purpose: replace the mechanical switch. It isn't very hard to think of the UI of an app to do that.</p> \n\n<h4>UI</h4>\n<p>I didn't burn my brain out thinking of the UI, after all it is just a switch, and that is precisely what I used, a <code>Switch</code> that will trigger a request to the Netduino on every toggle.</p>\n\n<h4>Using Sockets in a Xamarin.Forms app</h4>\n<p>Like the server, the client has a kind of \"interface\" that abstracts the usage of sockets in our app. Let's stop for a minute, when I first thought of this app I was wondering of how to manage sockets from a Forms application. I'd create a plugin and handle each platform indepently, but searching I came along with this <i>really, really</i> cool plugin: <a target=\"_blank\" href=\"https://github.com/rdavisau/sockets-for-pcl\">rda.SocketsForPcl</a>, it provides a fully functional set of classes to deal with sockets in every platform (even on iOS!). It is great to have a community creating stuff that you can use in your projects. With the socket issue solved, let's move on.</p>\n\n<p>There are two important methods whithin the \"interface\" class:</p> \n\n<pre class=\"csharp\">\npublic async Task<bool> GetLightSwitchStatus()\n\n    using (var s = new Sockets.Plugin.TcpSocketClient())\n    \n        await s.ConnectAsync(NetduinoIp, Port);\n        byte[] data = new byte[2];\n        data[0] = ReadLightSwitchState;\n        data[1] = ReadLightSwitchState;\n        s.WriteStream.Write(data, 0, 2);\n        s.ReadStream.Read(data, 0, 1);\n        return data[0] == ByteTrue;\n    \n\n</pre>\n\n<p>The above piece of code request the switch status from the server and returns true or false, depending on the status of the light switch.</p>\n\n<pre class=\"csharp\">\npublic async Task SetLightSwitchStatus(bool on)\n\n    using (var s = new Sockets.Plugin.TcpSocketClient())\n    \n        await s.ConnectAsync(NetduinoIp, Port);\n        byte[] data = new byte[2];\n        data[0] = WriteLightSwitchState;\n        data[1] = (byte)(on ? ByteTrue : ByteFalse);\n        s.WriteStream.Write(data, 0, 2);\n    \n\n</pre>\n\n<p>This piece of code sends a request to the server telling which state the light swich shoud be set to. Note how all the exchange of information is done via bytes, the first byte tells the server which operation is requested while the second one contains data when necessary. In the following vídeo I show the system working, though I still haven't wired the actual light bulb (since I'm scared of the high voltage), so I placed a 12V led instead for the demo.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/tLuWTyCHQ1w\" frameborder=\"0\" allowfullscreen></iframe>\n\n<h4>What next?</h4>\n<p>Well, this isn't really IoT as you may know it because this has little to do with the internet since the traffic is local, but I consider it to be a good starting point to build something more complex. For the next Netduino + Xamarin post I'll create a system that sends a notification over to my phone everytime someone opens my bedroom door, for that I'll use Parse, please fill in the <a href=\"/signup\">sign up</a> if you want me to keep you updated.</p>"
}