{	
	"id" : "/post/correcto-colecciones.1/",
	"tv" : false,
	"date": "2017-01-10 13:00:02 -0600",
	"title" : "Colecciones en C#, ¿cuál elegir?",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/aprende-c-sharp/colecciones/featured.jpg",
	"tags" :
	[ 
		"AprendeCSharp"
	],
	"content" : "<p>Hace poco escribí un <a href=\"..\yield-c-sharp\">post acerca de la interfaz IEnumerable</a>, en el cual hablaba de su uso es para cuando trabajamos con colecciones. En fin, las colecciones son algo con lo que seguramente ya estás familiarizado, en particular con <code>List&lt;T&gt;</code>, pero hey, debes saber (ysi no es que ya lo sabes), que existen otro tipo de colecciones además de la ya vieja confiable <code>List&lt;T&gt;</code>. Y que pueden tener <a href=\"/tv/o-grande\" target=\"_blank\">un mejor desempeño</a>.</p>

<p>En este post voy a tratar de explicarte el uso básico de <code>Queue&lt;T&gt;</code>, <code>Stack&lt;T&gt;</code>, <code>HashSet&lt;T&gt;</code>, <code>Dictionary&lt;TKey, TVal&gt;</code>.</p>

<h2 id=\"listt\">List<t></t></h2>
<p>Como dije antes, “la vieja confiable” y me atrevería a decir que es la colección más usada en los programas escritos con C#. Esto debido a que es, en teoría, la más sencilla de usar, ya que se comporta básicamente como los tan comunes arreglos al permitirnos <strong>acceder a cualquier elemento</strong> con la sintaxis de indizadores <code>[n]</code>, además da la posibilidad de <strong>añadir elementos en cualquier posición</strong> con <code>Insert</code> o emplear <code>Add</code> para <strong>añadir elementos <em>al final</em> de la lista</strong> sin necesidad de preocuparnos por reubicar los objetos ya existentes en ella:</p>

<p><figure><img src='/postimages/post/correcto-colecciones.1/post.jsonlist.png' alt='“List” images_set' /></figure></p>

<p>Esta es la colección <em>más</em> genérica y que nos puede ayudar en cualquiera de los casos, sin embargo no es la más reciomendable en cuanto a desempeño, y que si bien permite acceder a su contenido de forma constante <em>O(1)</em>, añadir nuevos elementos o insertar puede ser una operación muy pesada <em>O(n)</em>.</p>

<h2 id=\"queuet\">Queue<t></t></h2>
<p>En español la podríamos llamar “cola” o “fila”, y se comporta como funcionan las filas o colas en la vida real: los nuevos elementos se forman “hasta atrás” y los viejos elementos salen “por delante”. Para esta acción en lugar de contar con métodos como <code>Add</code> o <code>Insert</code>, nos ofrece <code>Enqueue</code> para <strong>insertar elementos al final</strong>, mientras que nos <strong>permite conocer al elemento <em>de enfrente</em></strong> mediante <code>Peek</code> y <strong>sacar dicho elemento</strong> usando <code>Dequeue</code>:</p>

<p><figure><img src='/postimages/post/correcto-colecciones.1/post.jsonqueue.png' alt='“Queue” images_set' /></figure></p>

<p>Esta colección es útil cuando no necesitamos acceso aleatorio a los datos o cuando es necesario mantener un orden determinado por el momento en que los elementos fueron añadidos a la colección.</p>

<p>El ejemplo más claro es si estamos desarrollando una aplicación para asignar los clientes a las ventanillas de un banco, en donde el primero en llegar debe ser el primero en ser atendido.</p>

<h2 id=\"stackt\">Stack<t></t></h2>
<p>O como le decimos en español: la pila. En cierto sentido es muy similar a una Cola, en el sentido de que <strong>permite insertar **al inicio</strong>* usando <code>Push</code>, <strong>acceder a él</strong> usando <code>Peek</code> y <strong>sacar el elemento más reciente</strong> usando <code>Pop</code>:</p>

<p><figure><img src='/postimages/post/correcto-colecciones.1/post.jsonstack.png' alt='“Stack” images_set' /></figure></p>

<p>Esta colección tabmién es útil cuando no necesitamos acceso aleatorio a los datos y queremos tener o cuando es necesario obtener siempre el elemento más recientemente insertado. La pila es una estructura que se comoce como LIFO (<em>last in, first out</em>): el último en llegar es el primero en salir.</p>

<p>Las pilas son comunmente usadas para invertir conjuntos, o para implementar operaciones de hacer-deshacer, y para procesar operaciones matemáticas de notación infja o posfija.</p>

<h2 id=\"hashsett\">HashSet<t></t></h2>
<p>La colección que a mi parecer es de las que menos se usan en el desarrollo, tiene una peculiaridad: no guarda los elementos dentro de ella, sino una representación numérica de ellos. Nos <strong>ofrece un método para insertar</strong> llamado <code>Add</code> que a su vez llama a <code>GetHashCode</code> para “convertir” lo que estamos insertando en un número entero y después guardarlo, y después revisar si existe meidante <code>Contains</code>:</p>

<p><figure><img src='/postimages/post/correcto-colecciones.1/post.jsonhashset.png' alt='“HashSet” images_set' /></figure></p>

<p>Esta es la colección ideal cuando únicamente queremos corroborar que un elemento existe dentro de un conjunto, insertar en un <code>HashSet</code> es una operación constante <em>O(n)</em>, al igual que revisar si alguno ya existe en él.</p>

<p>He visto muchas veces código como el siguiente:</p>

<p><figure class="highlight"><pre><code class="language-csharp" data-lang="csharp"><span class="kt">var</span> <span class="n">descuentos</span> <span class="p">=</span> <span class="k">new</span> <span class="n">List</span><span class="p">&lt;</span><span class="kt">double</span><span class="p">&gt;</span> <span class="p">{</span> <span class="m">10</span><span class="p">,</span> <span class="m">15</span><span class="p">,</span> <span class="m">30</span> <span class="p">};</span>
<span class="kt">var</span> <span class="n">miDescuento</span> <span class="p">=</span> <span class="m">5d</span><span class="p">;</span>
<span class="c1">// ...&lt;/double&gt;&lt;/p&gt;</span>

<span class="p">&lt;</span><span class="n">p</span><span class="p">&gt;</span><span class="k">if</span><span class="p">(</span><span class="n">descuentos</span><span class="p">.</span><span class="n">Contains</span><span class="p">(</span><span class="n">miDescuento</span><span class="p">))</span> <span class="c1">// …</span></code></pre></figure></p>

<p>Cuando bien podríamos obtener una mejora en el desempeño usando un <code>HashSet</code>, ya que no importa cuantos elementos contiene el set, obtendremos la respuesta <em>de inmediato</em>, mientras que si usamos una <code>List</code>, el tiempo que se tarda depende de cuantos elementos contenga:</p>

<p><figure class="highlight"><pre><code class="language-csharp" data-lang="csharp"><span class="kt">var</span> <span class="n">descuentos</span> <span class="p">=</span> <span class="k">new</span> <span class="n">HashSet</span><span class="p">&lt;</span><span class="kt">double</span><span class="p">&gt;</span> <span class="p">{</span> <span class="m">10</span><span class="p">,</span> <span class="m">15</span><span class="p">,</span> <span class="m">30</span> <span class="p">};</span>
<span class="k">if</span> <span class="p">(</span><span class="n">descuentos</span><span class="p">.</span><span class="n">Contains</span><span class="p">(</span><span class="n">miDescuento</span><span class="p">))</span> <span class="c1">// no hay necesidad de buscar</span></code></pre></figure></double></p>

<h2 id=\"dictionarytkey-tval\">Dictionary&lt;TKey, TVal&gt;</h2>
<p>El diccionario almacena pares de valores: una llave y un objeto asociado. 
Una colección extremadamente similar a un <code>HashSet</code>, ya que de igual manera convierte uno de los elementos (la llave) a un entero para asociarlo con el objeto. <strong>Para insertar ofrece el método</strong> <code>Add</code>, además de que deja acceder a los valores mediante la sintaxis de indizador <code>[]</code>, y revisar si un valor o una llave existen en el diccionario usando <code>ContainsKey</code> y <code>ContainsValue</code>:</p>

<p><figure><img src='/postimages/post/correcto-colecciones.1/post.jsondictionary.png' alt='“Dictionary” images_set' /></figure></p>

<h2 id=\"colecciones-no-genricas\">Colecciones no genéricas</h2>
<p>Las colecciones no genéricas se comportan de manera similar, con la pequeña gran diferencia de que estas colecciones no tienen información de los objetos que almacenan. Para ellos son cualquier cosa… como si simplementa guardaran cajas sin conocer su contenido:</p>

<p><figure><img src='/postimages/post/correcto-colecciones.1/post.jsongenerics.png' alt='“Genéricos” images_set' /></figure></p>
"
}