{	
	"id" : "/tv/xamarin-forms/",
	"tv" : true,
	"date": "2016-05-26 17:00:00 -0500",
	"title" : "Xamarin.Forms",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//tv/xamarinforms/featured.jpg",
	"tags" :
	[ 
		"Meta",
		"Tv",
		"Xamarin",
		"XamarinForms"
	],
	"content" : "<p>En un <a href=\"../xamarin\">video anterior les había ya hablado sobre Xamarin</a>, que es una tecnología que nos permite hacer aplicaciones multiplataforma. En aquel video les conté que de entrada, con Xamarin.iOS y Xamarin.Android debíamos seguir haciendo las interfaces gráficas como tradicionalmente se hacen, es decir, una interfaz para iOS, una para Android y otra para Windows pero también adelanté que existía una herramienta llamada Xamarin.Forms para compartir incluso el código de la interfaz.</p>

<p>Xamarin.Forms es una biblioteca, <a href=\"https://www.nuget.org/packages/Xamarin.Forms/\" target=\"_blank\" rel=\"nofollow\">que podemos descargar de NuGet</a>, que expone un conjunto de abstracciones de algunos elementos de interfaz gráfica comúnmente usados en plataformas como Android, iOS y el ya viejo, Windows Phone, recientemente, Universal Windows Apps.</p>

<p>Estas abstracciones se convertirán en tiempo de ejecución a controles nativos a cada plataforma, permitiendo así definir la interfaz una sola vez y que nuestra aplicación se muestre en el dispositivo como si hubiera sido escrita usando los controles definidos para cada plataforma.</p>

<p>Dentro de estas abstracciones de controles tenemos:</p>

<ul>
  <li>Páginas (Pages) que son elementos sobre los cuales se colocan los controles de interfaz gráfica, se podría decir que son parecidas a las <code>Activities</code> en Android o a los <code>ViewControllers</code> en iOS, pero solo se parecen, no cumplen las mismas funciones. Forms nos da algunas páginas predefinidas como:
    <ul>
      <li><code>ContentPage</code> que es la página más básica</li>
      <li><code>MasterDetailPage</code> que es una página que permite crear un efecto de menú en tu aplicación</li>
      <li><code>TabbedPage</code> que es una página con pestañas</li>
    </ul>
  </li>
</ul>

<p>En esta imagen puedes ver todas:</p>

<p><figure><img src='/postimages/tv/xamarin-forms/post.jsonpages.png' alt='“Xamarin.Forms stock pages” images_set' /></figure></p>

<ul>
  <li>Contenedores (Layouts) que nos permiten acomodar los elementos de interfaz gráfica dentro de una página, de igual manera, Forms nos da algunos <code>Layouts</code> comunes como:
    <ul>
      <li><code>StackLayout</code> para apilar los controles, uno sobre otro</li>
      <li><code>ScrollView</code> que permite acceder a elementos que están fuera de la pantalla del dispositivo</li>
      <li><code>Grid</code> que nos deja acomodar los elementos de interfaz en filas y columnas</li>
      <li><code>RelativeLayout</code> para colocar los elementos con posiciones relativas entre ellos</li>
    </ul>
  </li>
</ul>

<p>En fin, hay varios más</p>

<p><figure><img src='/postimages/tv/xamarin-forms/post.jsonlayouts.png' alt='“Xamarin.Forms stock layouts” images_set' /></figure></p>

<ul>
  <li>Controles (Views) son elementos visuales, y en donde realmente se “nota” más, el poder de Forms. Estos elementos visuales son los que reciben directamente la interacción del usuario, por ejemplo, en Forms tenemos:
    <ul>
      <li><code>Button</code>, que no necesita mucha explicaciòn</li>
      <li><code>Label</code> para mostrar texto</li>
      <li><code>Entry</code> que permite ingresar texto</li>
      <li><code>Image</code> que es un control que permite mostrar una imagen</li>
      <li><code>ListView</code> usado para mostrar elementos dentro de celdas en forma de lista</li>
      <li><code>TableView</code> muy similar a <code>ListView</code></li>
      <li><code>DatePicker</code> para seleccionar fecha</li>
      <li>En fin, hay muchos más.</li>
    </ul>
  </li>
  <li>Celdas (Cells) que como ya lo mencioné, se usan junto con las <code>ListView</code> o <code>TableView</code> para mostrar datos, en esta categoría hay celdas que nos permiten mostrar texto, texto e imágenes o controles como un Switch o una caja de texto.</li>
</ul>

<p><figure><img src='/postimages/tv/xamarin-forms/post.jsoncontrols.png' alt='“Xamarin.Forms stock layouts” images_set' /></figure></p>

<p>Xamarin.Forms funciona así: las abstracciones de controles se transforman en tiempo de ejecución a controles nativos, en cada plataforma hay un conjunto de <em>Renderers</em> que toman la abstracción y la convierten al control nativo. De tal manera que cuando nosotros usamos un control, por ejemplo digamos <code>Entry</code> (para recibir texto del usuario), estos <code>Renderers</code> lo convertirán en Android a un <code>EditText</code>, en iOS a un <code>UITextView</code> y en Windows a un <code>TextBox</code>:</p>

<p><figure><img src='/postimages/tv/xamarin-forms/post.jsonentry_rendering.png' alt='“Rendering” images_set' /></figure></p>

<p>Al ser abstracciones, es muy posible que muchas de las propiedades que son específicas a cada plataforma no estén disponibles en Xamarin.Forms ya que se trata de ofrecer un conjunto de propiedades común a todas las plataformas. Esto es una limitante, ya que con Forms no podemos alcanzar un alto nivel de personalización en nuestras apps.</p>

<h3 id=\"custom-renderers\">Custom renderers</h3>

<p>Pero no te desanimes, así como Forms hace uso de los renderers, tu también los puedes usar para especificar cómo quieres que se muestren los controles en cada plataforma o, inclusive, para añadir controles que no están disponibles a través de la API de Forms como <a href=\"https://www.nuget.org/packages/Messier16.…\" target=\"_blank\" rel=\"nofollow\">el checkbox que hice</a>. Si quieres saber más, <a href=\"https://developer.xamarin.com/guides/xamarin-forms/custom-renderer/introduction/\" target=\"_blank\" rel=\"nofollow\">puedes checar la documentación</a>.</p>

<h3 id=\"lenguaje-de-interfaz\">Lenguaje de interfaz</h3>

<p>Otra de las dudas más comunes es sobre el cómo escribimos la interfaz usando Xamarin.Forms, y pues las respuestas son dos:</p>

<p><figure><img src='/postimages/tv/xamarin-forms/post.jsonlanguage.png' alt='“Lenguaje de interfaz gráfica” images_set' /></figure></p>

<p>Sí, XAML y código C#. Yo preiero el código, aunque si tienes muchos controles, la cosa se puede tornar bastante fea si no tienes buena organización.</p>

<h3 id=\"cdigo-de-cada-plataforma\">Código de cada plataforma</h3>

<p>A pesar de usar Forms, nunca nos vamos a liberar de tener que ver (o usar) código dentro de cada plataforma, ya que como he mencionado antes, esta herramienta es simplemente una librería que es ejecutada cuando nuestra aplicación corre. Esto se ve cuando creamos un proyecto nuevo, en Android, dentro del archivo <code>MainActivity</code> y en iOS dentro de <code>AppDelegate</code> se carga la aplicación hecha con forms.</p>

<h3 id=\"code-behind-y-mvvm\">Code behind y MVVM</h3>

<p>Si has estado desarrollando en Windows Forms o con Java Swing es muy probable que conozcas el concepto de <em>code behind</em>, ese concepto se sigue empleando en Xamarin.Forms pero no se hace mucho énfasis en él como si se hace en patrón MVVM, que es un patrón que puede facilitar el desarrollo de aplicaciones de gran tamaño y complejidad.</p>

<h3 id=\"xamarin-tradicional-o-xamarinforms\">Xamarin tradicional o Xamarin.Forms</h3>
<p>Mucha gente se puede llegar a hacer esta pregunta: ¿Para qué siguen existiendo Xamarin.iOS y Xamarin.Android si ya tenemos Forms? y pues la razón está definida dentro de lo que ofrece el mismo Forms: la poca personalización que se puede conseguir. En general, se recomienda ir por la vía tradicional si:</p>

<ul>
  <li>Tu aplicación hace uso intensivo de las APIs nativas de cada plataforma (cosas como cámara, acelerómetro y por el estilo)</li>
  <li>Tu aplicación hace uso de una interfaz personalizada y distinta de la interfaz nativa</li>
  <li>Quieres usar el potencial del desempeño nativo</li>
  <li>Estás haciendo un juego</li>
</ul>

<p>Por otro lado, usa Forms si:</p>

<ul>
  <li>Tu app no usa muchas APIs de acceso a cámara, acelerómetro o cosas específicas del dispositivo</li>
  <li>La personalización de la interfaz no es tan importante</li>
  <li>Ya estás familiarizado con XAML o apenas estás teniendo contacto con el desarrollo móvil</li>
</ul>

<p>Te invito a revisar las etiquetas <a href=\"../../tag/XamarinForms/\">#XamarinForms</a> y <a href=\"../../tag/Xamarin/\">#Xamarin</a> si quieres saber más sobre el desarrollo móvil con esta tecnología. No olvides suscribirte y compartir el video.</p>
"
}