{	
	"id" : "/post/espacios-nombres-c-sharp/",
	"tv" : false,
	"date": "2017-01-24 13:00:01 -0600",
	"title" : "Espacios de nombres en C#",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//aprende-c-sharp/namespaces.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>El post de hoy trata sobre algo que muchos desarolladores a veces damos por hecho y no le prestamos mucha atención cuando estamos escribiendo el código de nuestras aplicaciones.</p>\n\n<p>Se trata de los <em>namespaces</em> o <em>espacios de nombres</em>, que no solo son esos líneas de código que vienen por default cuando creamos una aplicación nueva usando Visual Studio.</p>\n\n<p>Siempre ha sido una necesidad de gran importancia el poder acomodar nuestro código en bloques lógicamente relacionados, de tal modo que quede organizado y sea fácil de leer, entender y luego de esccribir. Para realizar esta organización nos podemos ayudar de los <em>nombres de espacios</em>.</p>\n\n<p>Para definir un <em>espacio de nombres</em> se usa la siguiente sintaxis:</p>\n\n<pre class=\"csharp\">\nnamespace [nombre del namespace]\n\n    // Alcance\n\n</pre>\n\n<p>Por ejemplo, mira la siguiente declaración de uno:</p>\n\n<pre class=\"csharp\">\nnamespace That\n\n</pre>\n\n<p>Los namespaces pueden ser anidados, es decir, uno dentro de otro, así que puedes hacer cosas como esta:</p>\n\n<pre class=\"csharp\">\nnamespace That\n\n    namespace C\n    \n        namespace Sharp\n        \n            namespace Guy\n            \n                public class Uno  \n</pre>\n\n<p>Otra forma de anidación es la siguiente:</p>\n\n<pre class=\"csharp\">\nnamespace That.C.Sharp.Guy\n\n    public class Dos  \n\n</pre>\n\n<p>O realuzar cualquier combinación:</p>\n\n<pre class=\"csharp\">\nnamespace That.C\n\n    namespace Sharp.Guy\n    \n        public class Tres  \n    \n\n</pre>\n\n<p>A final de cuentas todos los tipos terminan siendo accesibles de la misma manera:</p>\n\n<pre class=\"csharp\">\nThat.C.Sharp.Guy.Dos dos;\nThat.C.Sharp.Guy.Uno uno;\nThat.C.Sharp.Guy.Tres tres;\n</pre>\n\n<h2 id=\"reusar-espacios-de-nombres\">Reusar espacios de nombres</h2>\n\n<p>Es importante señalar que aunque no hay nada que nos impida usar los <em>espacios de nombres</em> del framework de .NET, como en el ejemplo siguiente:</p>\n\n<pre class=\"csharp\">\nnamespace System.Collections.Generic\n\n    public class OtraColeccion\n    \n    \n\n</pre>\n\n<p>Debes pensar dos veces al hacerlo, ya que a pesar de que funciona:</p>\n\n<pre class=\"csharp\">\nusing System.Collections.Generic;\n\nclass MainClass\n\n    static void Main(string[] args)\n    \n        OtraColeccion coleccion = new OtraColeccion();\n</pre>\n\n<p>Existe el potencial de confundir a los usuarios de tu código al hacerles creer que el framework contiene tipos de dato que en realidad no.</p>\n\n<h2 id=\"alcance-de-los-usings\">Alcance de los <code>usings</code></h2>\n<p>Los <em>espacios de nombres</em> nos ayudan también a establecer el alcance de otros <em>nombres de espacios</em> importados mediante la instrucción <code>using</code>, ya que podemos escribirlos dentro de la declaración de uno de ellos, indicando que ese <code>using</code> será válido solo dentro de su alcance:</p>\n\n<pre class=\"csharp\">\nnamespace Alcance\n\n    using System;\n</pre>\n\n<h2 id=\"el-alias-global\">El alias <code>global</code></h2>\n<p>Puede que mientras estamos desarrollando una app, te encuentres con la necesidad de escibir código que tenga los mismos identificadores que algúna otra porción existente, como es el caso de el siguiente ejemplo:</p>\n\n<pre class=\"csharp\">\nnamespace Spaceship\n\n    namespace System\n    \n        public class Console\n        \n            void TurnOn()\n            \n                //Console.WriteLine(\"La consola fue encendida\");\n</pre>\n\n<p>Como podrás observar, en el código anterior se definen un <em>espacio de nombres</em>: <code>Spaceship</code> y <code>System</code>, este último contiene la clase <code>Console</code>… ahora, imagina que dentro del método TurnOn queremos informar al usuario que la consola está encendida. Pero no podemos usar directamente el método <code>Console.WriteLine</code>, porque el compilador piensa que nos estamos refiriendo a <strong>nuestra</strong> clase <code>Console</code>.</p>\n\n<p>Pero no te preocupes, para este tipo de casos extremos ex que existe el alias <code>global</code> que en pocas palabras <em>reestablece</em> los alcances de los namespaces, permitiéndonos así hacer uso de -casi- cualquier espacio de nombres, sin importar que existan conflicto entre ellos. Para escribir a consola dentro del método anterior simplemente tenemos que reescribir la línea como sigue:</p>\n\n<pre class=\"csharp\">\nglobal::System.Console.WriteLine(\"La consola ha sido encendida\");\n</pre>\n\n<h2 id=\"eligiendo-un-nombre-de-espacio\">Eligiendo un nombre de espacio</h2>\n<p>Además del orden lógico muchas veces los <em>namespaces</em> se usan también para crear un “sentido” de pertenencia a quien creo el código. Muchas veces se sugiere que los nombres de espacio tengan la siguiente forma:</p>\n\n<p><code>&lt;Compañía&gt;.(&lt;Producto o Technología&gt;)[.&lt;Característica&gt;][.&lt;Nombres de espacio de código&gt;]</code></p>\n\n<p>Como en <code>Microsoft.Web.Infrastructure</code>, aunque también hay exepciones como <code>System.IO.Stream</code>.</p>\n\n<h2 id=\"necesito-meter-mi-cdigo-en-un-namespace\">¿Necesito meter mi código en un <em>namespace</em>?</h2>\n<p>No, no es necesario, puedes dejar todo tu código fuera de cualquier <em>namespace</em>, sin embargo esto no es tan recomendable por cuestiones meramente de organización. A menos que desemos que el tipo de dato creado esté disponibles globalmente en nuestro código.</p>\n"
}