{	
	"id" : "/post/linq-en-c-sharp-2/",
	"tv" : false,
	"date": "2016-02-01 14:00:00 -0600",
	"title" : "Linq en C# - segunda parte",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/linq-en-c-sharp/featured.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>Hace algunos cuantos posts <a href=\"/post/linq-en-c-sharp\">les hablaba de Linq en C#</a>, y este post es una especie de continuación, para que, si aún no has integrado esta poderosa herramienta dentro de tus tareas de desarrollo, por fin te animes a hacerlo.</p>\n\n<h3 id=\"preparando-el-terreno\">Preparando el terreno</h3>\n<p>Para este post me auxiliaré de tres elementos.</p>\n\n<ul>\n  <li>Las clases <code>Lecture</code>, <code>Teacher</code> que representarán nuestros objetos de negocios. Un profesor (<code>Teacher</code>) imparte una o más clases (<code>Lecture</code>).</li>\n  <li><code>FakeDatabase</code> que como su nombre lo indica, pretende ser una simulación de un almacenaje de datos con soporte para Linq. Hay que recordar que existen varias implementaciones: Linq to objects, Linq to SQL, Linq to XML, …</li>\n</ul>\n\n<h2 id=\"dos-sintaxis\">Dos sintaxis</h2>\n<p>Para usar Linq, tenemos disponibles dos formas de hacerlo: mediante el uso de la sintaxis de método o mediante la sintaxis de consulta, ambas son en su mayor parte intercambiables, sin embargo hay algunas funciones que únicamente son accesibles mediante la sintaxis de método. Diferenciarlas es sencillo, una son los métodos tradicionales mientras que la otra hace uso de palabras especiales como <code>from</code>, <code>in</code>, <code>select</code>.</p>\n\n<p>Por ejemplo, estas dos operaciones con Linq hacen lo mismo:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nfrom lecture in db.Lectures\ngroup lecture by lecture.TeacherId into grouped\njoin teacher in db.Teachers \n    on grouped.Key equals teacher.Id\nwhere teacher.LastName == \"Williams\"\nselect new  TeacherId = grouped.Key, \n             Name = teacher.GivenName ;\n</pre>\n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\ndb.Lectures\n.GroupBy (lecture =&gt; lecture.TeacherId)\n.Join (db.Teachers,\n        g =&gt; g.Key, t =&gt; t.Id,\n        (g, t) =&gt; new Grouped = g, Teacher = t)\n.Where (an =&gt; an.Teacher.LastName == \"Williams\")\n.Select (an =&gt; new  TeacherId = an.Grouped.Key,\n                     Name = an.Teacher.GivenName );\n</pre>\n</div>\n</div>\n\n<p>Tal vez con solo ver los ejemplos anteriores ya tengas tu favorito, pero no te dejes llevar todavía, los dos tienen sus fortalezas. Sin olvidar que hay operaciones únicamente disponibles en la sintaxis de método, para mí la sintaxis de método tiene el poder de las <a href=\"/post/lambdas-en-c-sharp\">expresiones lambda</a> y la sintaxis de consulta es más legible al ojo humano.</p>\n\n<p>Sin importar por cual nos decidamos, el compilador siempre toma las consultas en Linq y las transforma a métodos, puesto que <strong>elegir una sobre otra es únicamente cuestión de gustos</strong> y necesidad del programador ya que <strong>no existe un beneficio en desempeño entre una y otra</strong>. De hecho, la <a href=\"https://msdn.microsoft.com/en-us/library/bb397676.aspx\" target=\"_blank\">recomendación de Microsoft es</a>:</p>\n\n<blockquote>\n  <p>Usa sintaxis de consulta en donde sea posible y sintaxis de método cuando sea necesario.</p>\n</blockquote>\n\n<p>Yo no la sigo al pie de la letra, de nuevo: cuestión de gustos. Porque a mi parecer hay algunas consultas que son más sencillas de escribir y leer como métodos, como un simple filtrado con <code>Where</code>, o en ocasiones la combinación de ambas facilita la lectura.</p>\n\n<h2 id=\"proyecciones-select-select\">Proyecciones (Select, select)</h2>\n<p>La finalidad de usar Linq es el hacer consultas, el resultado de nuestras consultas está definido por las proyecciones que hacemos sobre los datos, dichas proyecciones están definidas por la cláusula <code>select</code> o el método <code>Select</code>.</p>\n\n<p>Con ellos se puede modelar los resultados de una consulta en un <a href=\"/post/anonimos-en-c-sharp\">tipo anónimo</a> o en un tipo previamente creado por nosotros. Por ejemplo, en la consulta anterior, el resultado era un conjunto de elementos que tenían las propiedades  <code>int TeacherId</code> y <code>string Name</code>. Es posible que usando los métodos de Linq, muchas veces se omita la proyección y es cuando se realiza una “proyección implícita”, mientras que usando consultas siempre es necesario hacer un <em>select</em>.</p>\n\n<p>Solo por decir, así como en la consulta se crea un tipo anónimo con</p>\n\n<pre class=\"csharp\">\nnew  TeacherId = grouped.Key, Name = teacher.GivenName ;\n</pre>\n\n<p>Igual se pudo haber creado un objeto de <code>Teacher</code> con</p>\n\n<pre class=\"csharp\">\nnew Teacher  TeacherId = grouped.Key, GivenName = teacher.GivenName ;\n</pre>\n\n<h2 id=\"operadores-de-agregacin\">Operadores de agregación</h2>\n<p>Promedios, sumas, mínimos… de todo. Usualmente metemos esto dentro de un <code>for</code> más unas cuantas variables auxiliares y tenemos el resultado, con Linq, eso se acaba.</p>\n\n<h3 id=\"conteo-count\">Conteo (Count)</h3>\n<p>Supongamos que queremos contar la cantidad de profesores cuyo nombre comienza con <code>L</code>, entonces debemos utilizar el método <code>Count</code> (no está disponible en la sintaxis de consulta), y se hace de la siguiente manera:</p>\n\n<pre class=\"csharp\">\nvar profesoresConL = db.Teachers.Count(p =&gt; p.GivenName.StartsWith(\"L\"));\n</pre>\n\n<p>La llamada al método <code>Count</code> se puede hacer sin parámetros o pasando un <code>Func</code> que actúa como condicional  para indicar qué elementos dentro de la colección deben ser considerados para la cuenta.</p>\n\n<h3 id=\"suma-sum\">Suma (Sum)</h3>\n<p>¿Cuantos años en total suman los profesores que tienen menos de 30? fácil, con más Linq. En este caso es necesario aplicar una función de filtrado antes de hacer la sumatoria, el filtrado se puede hacer con la sintaxis de consulta, pero la sumatoria debe ser con la de método:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar edadMasMenos30 = db.Teachers\n    .Where (t =&gt; t.Age &lt; 30)\n    .Sum (t =&gt; t.Age);\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar menosDe30Total1 = (from t in db.Teachers\n                        where t.Age &lt; 30\n                        select t.Age).Sum ();\n</pre>  \n</div>  \n</div>\n\n<h3 id=\"mnimos-y-mximos-min-max\">Mínimos y máximos (Min, Max)</h3>\n<p>No todos los profesores tienen correo electrónico, ¿tendrá algo que ver con la edad? con los métodos <code>Min</code> y <code>Max</code> podemos obtener los valores máximos y mínimos dentro de un conjunto de resultados:</p>\n\n<pre class=\"csharp\">\nvar edadMinSinEmail = (from t in db.Teachers\n                        where t.Email == \"\"\n                        select t).Min (t =&gt; t.Age);\n\nvar edadMaxSinEmail = db.Teachers\n    .Where (t =&gt; t.Email == \"\")\n    .Max (t =&gt; t.Age);  \n</pre>\n\n<h3 id=\"promedio-average\">Promedio (Average)</h3>\n<p>Mmm… ¿Qué tal si probamos con los promedios de edad?, podemos usar el método <code>Average</code> para obtenerlo, primero filtramos los resultados para después obtener el promedio:</p>\n\n<pre class=\"csharp\">\nvar promedioEdadSMail = (from t in db.Teachers\n    where t.Email == \"\"\n    select t).Average (t =&gt; t.Age);\n\nvar promedioEmailCMail = db.Teachers\n    .Where (t =&gt; t.Email != \"\")\n    .Average (t =&gt; t.Age);\n</pre>\n\n<p>También existe una función llamada <code>Aggregate</code> que nos da flexibilidad para integrar nuestra propia funcionalidad de agregación.</p>\n\n<h2 id=\"cuantificadores\">Cuantificadores</h2>\n<p>Otro lugar en donde metíamos un <code>bool</code>, un ciclo <code>for</code>, un condicional y problema resuelto. Usando Linq lo único que necesitamos es la condición.</p>\n\n<h3 id=\"todos-los-elementos-all\">Todos los elementos (All)</h3>\n<p>Podemos usar el método <code>All</code> para verificar que todos los elementos dentro del conjunto cumplen con la condición especificada, <strong>si todos cumplen la condición</strong>, el método nos regresará <code>true</code>. Por ejemplo, si quisiéramos saber si todos los maestros tienen más de 18 años:</p>\n\n<pre class=\"csharp\">\nbool todosMayores = db.Teachers.All(teacher =&gt; teacher.Age &gt; 18);\n</pre>\n\n<h3 id=\"algn-elemento-any\">Algún elemento (Any)</h3>\n<p>Contrario a <code>All</code>, el método <code>Any</code> devolverá <code>true</code> cuando exista <strong>al menos un elemento que cumpla con la condición</strong> que se le pasa como argumento. Por ejemplo, si queremos saber si existe algún maestro que se llame Cosme Fulanito:</p>\n\n<pre class=\"csharp\">\nbool existeCosmeFulanito = db.Teachers.Any(teacher =&gt; teacher.GivenName == \"Cosme\"\n                            &amp;&amp; teacher.LastName == \"Fulanito\");\n</pre>\n\n<p>Otra de las funciones de <code>Any</code> es evitarnos el “molesto” condicional de <code>.Count &gt; 0</code>. Porque si llamamos <code>Any</code> sin pasar ningún condicional, este nos devolverá <code>true</code> siempre que nuestra secuencia contenga algún elemento. Digamos que antes de seguir queremos saber si hay clases registradas:</p>\n\n<pre class=\"csharp\">\nbool hayClases = db.Lectures.Any();  \n</pre>\n\n<h2 id=\"ordenamiento-orderby-orderby\">Ordenamiento (OrderBy, orderby)</h2>\n<p>Con Linq también es posible ordenar nuestros conjuntos de datos. Solo hay que recordar que generalmente el ordenamiento operará solo de manera temporal y que el ordenamiento no permanecerá una vez que hemos dejado de trabajar con los datos.</p>\n\n<p>Para ordenar podemos usar tanto la cláusula <code>orderby</code> y especificarle la propiedad a usar como referencia o el método <code>OrderBy</code> y usar una expresión lambda para el mismo fin. Vamos a ordenar a los maestros por la longitud de su apellido:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar maestrosOrdenados1 = db.Teachers\n    .OrderBy(t =&gt; t.LastName.Length);\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\nvar maestrosOrdenados2 = \n        from t in db.Teachers\n        orderby t.LastName.Length\n        select t;\n</pre>  \n</div>  \n</div>\n\n<p>También tenemos disponible la cláusula <code>descending</code> y el método <code>OrderByDescending</code> que invertirán el ordenamiento, se usan así:</p>\n\n<div class=\"pure-g\">\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\n.OrderByDescending(t =&gt; t.LastName.Length);\n</pre>  \n</div>\n<div class=\"pure-u-1 pure-u-md-1-2\">\n<pre class=\"csharp\">\norderby t.LastName.Length descending\n</pre>  \n</div>  \n</div>\n\n<p>¿Pero qué ocurre cuando queremos tomar en cuenta dos propiedades para realizar el ordenamiento? pues para eso podemos usar el método <code>ThenBy</code> o <code>ThenByDescending</code> para especificar otra condición de ordenamiento.</p>\n\n<pre class=\"csharp\">\nvar maestrosOrdenados3 = db.Teachers\n    .OrderBy(t =&gt; t.LastName.Length)\n    .ThenByDescending(t =&gt; t.GivenName);\n</pre>\n\n<h2 id=\"operadores-de-particin\">Operadores de partición</h2>\n<p>Los operadores de partición son especialmente útiles para paginar los resultados, estos permiten considerar (o no considerar) cierta cantidad de elementos al inicio de la secuencia que los contiene.</p>\n\n<h3 id=\"toma-take\">Toma (Take)</h3>\n<p>El método <code>Take</code> recibe un entero como parámetro que especifica la cantidad de elementos que son requeridos de toda la secuencia sobre la que opera, en caso de que haya menos de los requeridos únicamente devolverá los que encontró. Por ejemplo, si quisiéramos tomar los primeros 5 maestros más jóvenes, menores de 20 años:</p>\n\n<pre class=\"csharp\">\nvar cincoMenores20 = (from t in db.Teachers\n                      where t.Age &lt; 20\n                      orderby t.Age\n                      select t).Take (5);\n</pre>\n\n<h3 id=\"salta-skip\">Salta (Skip)</h3>\n<p>Podríamos verlo como el contrario de <code>Take</code>, ya que <code>Skip</code> igualmente toma un entero, pero este entero indica cuántos elementos de la secuencia debe ignorar antes de comenzar a tomar en cuenta. Supongamos que necesitamos tomar todos los maestros mayores de 30 años, comenzando por los mayores, pero ignorar a los primeros 4:</p>\n\n<pre class=\"csharp\">\nvar otrosMaestros = db.Teachers\n    .Where(t=&gt; t.Age &gt; 30)\n    .OrderByDescending(t =&gt; t.Age)\n    .Skip(4);\n</pre>\n\n<p>También existe un método que se llama <code>TakeWhile</code> y otro que se llama <code>SkipWhile</code>, ambos requieren de una condición sobre la que se decidirá a partir de cuándo comenzar a tomar (o dejar de ignorar) los elementos de la secuencia.</p>\n\n<h4 id=\"lo-que-sigue\">Lo que sigue</h4>\n<p>Una vez que hemos visto el poder de Linq con estos ejemplos relativamente sencillos, no queda más que seguir y aprender sobre agrupamientos, uniones, intersecciones y otras cuantas cosas un poco más complejas. Lo visto aquí sigue sin ser lo más impresionante de esta herramienta. Recuerda que puedes encontrar el código fuente en la información del post.</p>\n"
}