{	
	"id" : "/post/introduccion-xamarin-forms-sharpuladora/",
	"tv" : false,
	"date": "2015-11-26 15:00:00 -0600",
	"title" : "Introducción a Xamarin.Forms (app Sharpuladora)",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages/introduccion-xamarin-forms-sharpuladora/featured.png",
	"tags" : ["Xamarin","XamarinForms","Guia"],
	"content": "Sharpuladora\n=  \n¿Quién no ha hecho un clásico \"Hola mundo!\" cuando inicia a trabajar con un nuevo lenguaje/framework?\nPues bueno, tan clásico es el *hola mundo* como hacer una calculadora y para Xamarin.Forms no es la excepción. En esta guía te mostraré cómo usar algunos controles para crear tus apps... y entre ellas ¡tu propia calculadora!  \n\n# ¿Cómo funciona esta guía? \nEsta guía emplea un formato interactivo, viene acompañada de código que puedes probar y modificar al momento que haces el ejercicio. El código se divide en tres o cuatro carpetas:  \n\n - **start** es el punto de inicio de la guía, contiene una solución preparada para comenzar a trabajar.\n - **parts** son todos y cada uno de los archivos necesarios para completar la guía, usualmente son provistos como referencia para que si te llegas a atorar con algo los revises y si es necesario copies el código para seguir avanzando con la guía. Este documento está dividido en partes y a cada una de ellas le corresponde una subcarpeta. \n - **final** es el resultado final, al que queremos llegar con la guía. Esta carpeta, al igual que la carpeta `parts` es incluida como referencia, para mostrar el producto final.\n - **bonus** (opcional) muchas veces, al tratar de mostrar un concepto, es muy probable que se omitan algunas buenas prácticas, se evite el uso de librerías de terceros, etc. Por lo cual, esta carpeta contendrá una aplicación similar a la que se encuentra en `final` pero tomando en cuenta cosas que se pudieron haber omitido para favorecer el aprendizaje del tema tratado.  \n \nComo se menciona antes, esta guía está dividida en varias partes que componen los temas que se verán a lo mientras comienzas a desarrollar tu propia app. Es muy probable que en cada parte se vea una porción de código y posteriormente se haga referencia a uno o varios archivos en los que se hace uso de lo mencionado, estos son los archivos que vas a encontrar dentro de la carpeta `parts`.  \n\nSi tienes dudas sobre el funcionamiento de la guía, házmelas saber a feregrino@thatcsharpguy.com o @io_exception en Twitter. \n\n# La Sharpuladora\n\n## Introducción  \nDentro de esta guía se asume que ya tienes un entendimiento básico de cómo es que funciona Xamarin, si no, te invito a que consultes [Getting started with Xamarin](https://developer.xamarin.com/guides/cross-platform/getting_started/). Mi post sobre [qué necesitas para desarrollar con Xamarin](http://thatcsharpguy.com/post/xamarin-como-empiezo/) o este otro sobre cómo ir [de la consola a apps móviles](http://thatcsharpguy.com/post/from-console-to-mobile/). O cualquier otro recurso de confianza.\n\n## Parte 1 - Familiarizándose con el código  \nComo todos los entornos de desarrollo, tanto Xamarin Studio como Visual Studio tienen su propia manera de gestionar los archivos que componen nuestras aplicaciones, pero en breve te cuento que en estos entornos se dividen los proyectos por plataforma, siendo así que como queremos que nuestra calculadora esté disponible para tres distintas tendremos tres proyectos diferentes más uno, que es el núcleo de nuestra aplicación. Escribí un post sobre esto, para conocer más, visita [¿Cómo organiza mi código Visual Studio?](http://thatcsharpguy.com/post/organizacion-codigo-visual-studio/).  \n  \nEs momento de empezar a meterle mano al código, abre la solución `Sharpuladora.sln` que está dentro de la carpeta `start` y mira el panel del explorador de soluciones. Para esta parte no hay código que agregar, solo ver. Una vez que hayas explorado lo suficiente, avanza a la parte 2.  \n\n## Parte 2 - Las páginas  \nLas interfaces gráficas de las aplicaciones en Xamarin.Forms se compone de un conjunto de elementos del tipo `Page`, sin embargo, Forms nos ofrece algunas páginas pre-programadas que podemos usar para trabajar con muestras apps. Puedes consultar el listado completo <a href=\"https://developer.xamarin.com/guides/cross-platform/xamarin-forms/controls/pages/\" target=\"_blank\">aquí</a>.  \n\nLa *Sharpuladora* únicamente consta de una sola pantalla, que creamos a partir de una `ContentPage` que es de las más sencillas de manejar.  \n\n### Parte 2.1 - Creando la página principal  \nPara crear una página nueva tenemos en realidad dos opciones: crearla en código C# o usar XAML para hacerlo. En este caso utilizaremos C#.  \n  \nCrea una nueva carpeta llamada `Pages` dentro del proyecto `Sharpuladora` y dentro, crea una nueva clase de C# llamada `CalcPage` que derive de `ContentPage`.  \n\n##### Código\nArchivo `CalcPage.cs`\n\n### Parte 2.2 - Estableciendo una página de inicio  \nEs importante establecer la pantalla de inicio de nuestra aplicación y para el caso de Xamarin.Forms se debe especificar a través de una propiedad. Dicha propiedad se llama `MainPage` y se encuentra en la clase `App` (dentro de `App.cs`).  \n  \nEn la solución dentro de `start` la propiedad `MainPage` es inicializada con una página creada ahí mismo, debemos cambiarla por una referencia a nuestra `CalcPage`:  \n<pre class=\"csharp\">\nMainPage = new CalcPage();\n</pre>\n\n##### Código\nArchivo `App.cs`\n\n## Parte 3 - El layout  \nNuestra página actúa como un contenedor para los elementos de la interfaz, sin embargo, debemos agregarle un *layout* para indicarle la organización de dichos elementos. Al igual que con las páginas, Forms viene pre-cargado con una colección de *layouts* que puedes consultar en este <a href=\"https://developer.xamarin.com/guides/cross-platform/xamarin-forms/controls/layouts/\" target=\"_blank\">enlace</a>.  \n  \n### Parte 3.1 - El Grid  \nUna calculadora sencilla no requiere de mucho pensar, los botones están ordenados en filas y columnas, lo cual parece un trabajo para un `Grid`.  \n  \nUn `Grid` está compuesto de filas y columnas, las cuales en Xamarin.Forms se especifican a través de `RowDefinition` o `ColumnDefinition`. Mira el siguiente código:  \n<pre class=\"csharp\">\nvar layout = new Grid();\n\n// Filas:\nlayout.RowDefinitions.Add(new RowDefinition  Height = new GridLength(2, GridUnitType.Star) );\nlayout.RowDefinitions.Add(new RowDefinition  Height = new GridLength(1, GridUnitType.Star) );\n\n// Columnas:\nlayout.ColumnDefinitions.Add(new ColumnDefinition  Width = new GridLength(1, GridUnitType.Star) );\nlayout.ColumnDefinitions.Add(new ColumnDefinition  Width = new GridLength(1, GridUnitType.Star) );\n</pre>\n\nEn el código anterior se crea un nuevo `Grid` llamado `layout` y se le añaden dos columnas y dos filas. Algo importante a notar es que para las columnas se les establece la propiedad `Width` y para las filas a propiedad `Height`. El hecho de que se use `GridUnitType.Star` (o `*`) indica que el tamaño de las columnas será proporcional entre ellas.  \n  \nPara el ejercicio, crea un grid con filas y columnas que representen el siguiente gráfico: \n\n post_image grid.png \"Grid\" \n  \nUna vez creado el *layout* es importante especificarle a nuestra página que debe usarlo como contenido, esto se hace normalmente al final del constructor de la página con la siguiente línea de código:  \n<pre class=\"csharp\">\nContent = _layout;\n</pre>\n\n##### Código\nArchivo `CalcPage.cs`\n\n## Parte 4 - Los elementos de interfaz  \nUna vez creado el contenedor para nuestros elementos (nuestro *layout*), es momento de continuar con la creación de la interfaz.  \nUsaremos botones para los dígitos y los operadores y un *label* para mostrar el resultado.  \n\nLa inicialización de controles es bastante sencilla, por ejemplo, para crear el botón que será el '0' en nuestra calculadora tenemos que escribir el siguiente código:  \n<pre class=\"csharp\">\n_b0 = new Button  Text = \"0\" ;\n</pre>\n\nUna vez creado el control debemos añadirlo al *layout* contenedor para que se muestre en la pantalla. Recordemos que nuestro *layout* se compone de filas y columnas, así que debemos asignarle una fila y una columna en donde mostrarse a nuestro control, la clase `Grid` nos permite asignarlos con los métodos estáticos `SetColumn` y `SetRow`. En el código siguiente, se le asigna la columna 1 y la fila 4 al botón `_b0`:  \n<pre class=\"csharp\">\nGrid.SetColumn(_b0, 1);\nGrid.SetRow(_b0, 4);\n</pre>\nPara posteriormente añadirlo al *layout* con:  \n<pre class=\"csharp\">\n_gridLayout.Children.Add(_b0);\n</pre>\n\nPara el caso de la etiqueta en donde se mostrará el resultado, haremos uso del método `SetColumnSpan` para indicarle a nuestro control que debe usar más de una columna dentro del *layout* que lo contiene. En este caso, le estamos indicando a `_resultDisplay` que debe ocupar 4 columnas:  \n<pre class=\"csharp\">\nGrid.SetColumnSpan(_resultDisplay, 4);\n</pre>\n\nTambién existe `SetRowSpan` si lo que deseamos es que el control ocupe más de una fila.\n\n##### Código\nArchivo `CalcPage.cs`\n\n## parte 5 - Los eventos  \nEn una calculadora como la que estamos haciendo se requiere de interacción de los usuarios y en Xamarin.Forms las interacciones son manejadas a través de eventos. Cada uno de los controles que añadimos a una página pueden tener uno o más eventos que son \"lanzados\" por interacciones con el usuario (o con otros elementos de nuestro programa), como programadores es necesario indicar qué eventos queremos manejar y cómo los vamos a manejar.  \n  \nPara nuestra calculadora vamos a manejar el evento `Clicked` de los botones, dicho evento es lanzado cada vez que el usuario da \"click\" sobre el botón. Manejar eventos es cosa sencilla en C#, lo que tenemos que hacer es asignar (con el operador `+=`) un manejador al evento del control que deseamos. En el siguiente fragmento de código se especifica un manejador para el evento `Clicked` de `_b0`:  \n<pre class=\"csharp\">\n_b0.Clicked += OnNumericButtonClicked;\n</pre>\n\nEl manejador `OnNumericButtonClicked` no es más que un método que tiene como tipo de retorno `void` y recibe dos argumentos:  \n\n - `object sender` que es una referencia al control que lanzó el evento\n - `EventArgs e` que son algunos argumentos extra sobre el evento lanzado \n\nComo ejemplo acá abajo está la implementación del método para los botones del teclado numérico de nuestra calculadora. En la primera línea se hace un *cast* de `sender` a `Button` lo cual es válido porque como comenté: en `sender` viene el control que lanzó el evento.   \n<pre class=\"csharp\">\nvoid OnNumericButtonClicked(object sender, EventArgs e)\n\n\tButton botonClickeado = (Button)sender;\n\tif (primerNumero == null || primerNumero == \"\")\n\t\n\t\tprimerNumero = botonClickeado.Text;\n\t\n\telse\n\t\n\t\tsegundoNumero = botonClickeado.Text;\n\t\n\n</pre>\n\nLos manejadores pueden ser compartidos entre muchos controles, así que no tienes que crear un manejador para cada control que uses en tu aplicación. Así que ahora es tu turno de crear toda la lógica de la calculadora usando los controles y los manejadores de eventos. Si te encuentras un poco perdido puedes echarle un ojo al archivo que te indico más abajo para comenzar.\n\n##### Código\nArchivo `CalcPage.cs`\n\n## Parte 6 - Un pequeño truco  \nPodrás pensar que nuestra calculadora está (casi) terminada, pero no. Si la echas a andar a como la tenemos hasta ahora te darás cuenta que la calculadora no ocupa la pantalla entera... un pequeño bug. Para resolverlo haremos uso de otro tipo de *layout* que envuelva a nuestro *layout* original. Para la ocasión haremos uso de un `RelativeLayout` que nos permite mayor flexibilidad a la hora de controlar cómo se muestran los elementos y por ende, requiere de mayor configuración. Reemplaza la asignación `Content = _layout;` por el siguiente fragmento de código:  \n<pre class=\"csharp\">\n// Trick to make our calculater fullscreen\nvar relativeLayout = new RelativeLayout();\nrelativeLayout.Children.Add(_layout, // <= Original layout\n\tConstraint.Constant(0),\n\tConstraint.Constant(0),\n\tConstraint.RelativeToParent(p => p.Width),\n\tConstraint.RelativeToParent(p => p.Height));\nContent = relativeLayout;\n</pre>\n\n# Siguientes pasos  \nComo probablemente te habrás dado cuenta, la aplicación no está completa, le falta implementar algunos manejadores y toda la lógica de la calculadora.  Esa es tu misión, si decides aceptarla.  \n\nRecuerda que si llegas a tener dudas sobre lo visto en esta guía puedes contactarme vía [correo](mailto:feregrino@thatcsharpguy) o [Twitter](https://twitter.com/io_exception). \n\n# Reto  \nSi vives en el DF y me envías una versión de la calculadora completa a feregrino@thatcsharpguy.com puedes ganarte una copia física del libro Creating Mobile Apps with Xamarin.Forms Book Preview 2 de Charles Petzold, tengo varias para regalar además de otras cuantas cosas de Xamarin. Así que ya sabes, envíame tu calculadora terminada, no importa si está totalmente basada en el ejercicio de esta guía.\n\nPD: Si no te aguantas las ganas de tener el libro, puedes <a href=\" https://developer.xamarin.com/guides/cross-platform/xamarin-forms/creating-mobile-apps-xamarin-forms/\" target=\"_blank\">descargar el e-book</a>.\n"
}