{	
	"id" : "/post/out-ref-c-sharp/",
	"tv" : false,
	"date": "2016-04-11 14:00:01 -0500",
	"title" : "out y ref en C#",
	"author" : "Antonio Feregrino Bolaños",
	"featured_image": "http://thatcsharpguy.com/postimages//aprende-c-sharp/ref-out.png",
	"tags" : ["AprendeCSharp"],
	"content": "<p>En un post anterior hablé acerca de <a href=\"../metodos-c-sharp\">métodos en C#</a>, ahí mencioné que los parámetros que recibía un método nos daban muchas posibilidades a la hora de desarrollar, y la característica de la que hablaré es otra de esas posibilidades.</p>\n\n<p>Seguramente si en alguna vez de tu carrera has usado código C o C++ te has encontrado con estos operadores: <code>*</code> o  <code>&amp;</code> que, en pocas palabras, nos sirven para trabajar con punteros y también sabrás que estos nos permitían pasar como referencia una variable, entonces ya sabíamos que para modificar el valor de una variable dentro de una función teníamos que pasar el apuntador a dicho objeto como argumento.</p>\n\n<p>Pues bien, en C# existen las palabras <code>ref</code> y <code>out</code> que vienen a realizar una tarea similar ya que al usarlos para declarar y llamar a algún método, permiten que el argumento sea pasado por referencia (digamos que algo “similar” a los punteros) y no por valor.</p>\n\n<h3 id=\"declaracin\">Declaración</h3>\n\n<p>Si deseamos emplear valores por referencia en algún método, es necesario expresarlo desde su definción:</p>\n\n<pre class=\"csharp\">\npublic void Swap(ref int a, ref int b) // ...\npublic bool SumaMaxima(int a, int b, int max, out int resultado) // ...\npublic string WeirdMethod(ref int a, ref int b, out int s, out int r) // ...\n</pre>\n\n<p>En el primer caso, vemos que tanto <code>a</code> como <code>b</code> son enteros que el método recibe por referencia. En el segundo, únicamente <code>resultado</code> es una referencia y en el tercero <code>a</code>, <code>b</code>, <code>s</code> y <code>r</code> son pasados de esta manera.</p>\n\n<p>Para trabajar con las referencias dentro del método no tenemos que hacer nada especial, podemos usarlas como si fueran parámetros normales:</p>\n\n<pre class=\"csharp\">\npublic void Swap(ref int a, ref int b)\n\n    int m = a;\n    a = b;\n    b = m;\n\n\npublic bool SumaMaxima(int a, int b, int max, out int resultado)\n\n    resultado = a + b;\n    if (resultado &gt;= max)\n    \n        resultado = max;\n        return true;\n    \n    return false;\n\n\npublic string WeirdMethod(ref int a, ref int b, out int s, out int r)\n\n    s = a + b;\n    r = a - b;\n    return a.ToString() + b.ToString();\n\n</pre>\n\n<h3 id=\"uso\">Uso</h3>\n\n<p>Para usarlos, también es necesario indicar en la llamada al método que los parámetros deben ser pasados de determinado modo, fíjate en la llamada a <code>Swap</code> en el siguiente código</p>\n\n<pre class=\"csharp\">\nint a = 100, b = 5;\nConsole.WriteLine(\"Valor de a:\" + a + \" - Valor de b:\" + b);\n\nparametros.Swap(ref a, ref b);\n\nConsole.WriteLine(\"Valor de a:\" + a + \" - Valor de b:\" + b);\n</pre>\n\n<p>El resultado es el siguiente</p>\n\n<pre>\nValor de a:100 - Valor de b:5  \nValor de a:5 - Valor de b:100\n</pre>\n\n<p>Y esta es una llamada a un método con <code>out</code></p>\n\n<pre class=\"csharp\">\nint resSuma;\nvar isResultOk = parametros.SumaMaxima(a, b, 100, out resSuma);\n\nif (isResultOk)\n    Console.WriteLine(\"La suma excedió el valor máximo\");\nelse\n    Console.WriteLine(\"El resultado de la suma es \" + resSuma);\n</pre>\n\n<p>Que da como resultado\n<code>\nLa suma excedió el valor máximo\n</code></p>\n\n<h3 id=\"la-diferencia-entre-ref-y-out\">La diferencia entre ref y out</h3>\n\n<p>Hasta ahora parecen similares, sin embargo, mientras que ambas son referencias, la semántica que tienen es distinta.</p>\n\n<p>+*Debemos usar <code>out</code> cuando se espera que sea el método llamado el encargado de asignarle valor**, así que si creas un método con un parámetro del tipo <code>out</code> y no le asignas valor dentro del mismo, el compilador te dará un error. Por ejemplo, si la definición de <code>WeirdMethod</code> fuera la siguiente:</p>\n\n<pre class=\"csharp\">\npublic string WeirdMethod(ref int a, ref int b, out int s, out int r)\n\n    return a.ToString() + b.ToString();\n\n</pre>\n\n<p>Obtendríamos un error como este: <code>The out parameter 'r' must be assigned to before control leaves the current method</code>.</p>\n\n<p>Además, <strong>la variable que le pasamos como <code>out</code> puede o no estar inicializada antes de ser enviada al método</strong> sin que el compilador genere siquiera una advertencia.</p>\n\n<h3 id=\"ejemplo-de-la-vida-real\">Ejemplo de la vida real</h3>\n<p>Existen muchos escenarios en los que podemos usar el paso por referencia en nuestros programas, pero uno de los ejemplos màs significativos son los métodos <code>TryParse</code>, que reciben un parámetro <code>out</code> y regresan un valor <code>bool</code>. En ellos se intenta hacer la conversión de cadena al tipo de dato especificado y devuelven verdadero o falso dependiendo de si la conversión resultó exitosa, y en caso de que si, el valor vendrá asignada en el parámetro marcado:</p>\n\n<pre class=\"csharp\">\nstring dec = \"abcd\";\nstring dec2 = \"555\";\n\ndecimal one;\ndecimal two;\n\nif (Decimal.TryParse(dec, out one))\n    Console.WriteLine(\"Convertí \" + dec + \" en \" + one);\nelse\n    Console.WriteLine(dec  + \" no es convertible a decimal\");\n\n\nif (Decimal.TryParse(dec2, out two))\n    Console.WriteLine(\"Convertí \" + dec2 + \" en \" + two);\nelse\n    Console.WriteLine(dec  + \" no es convertible a decimal\");\n</pre>\n\n<h3 id=\"lo-que-sigue\">Lo que sigue</h3>\n\n<p>Te invito a que pruebes con el código que acompaña al post y que si tienes alguna duda me la hagas saber en Twitter o al correo electrónico. En realidad no es muy común que tu tengas que implementar los parámetos de este tipo en tu código, sin embargo si se puede presentar el caso y no hay más que estar preparado y conocerlos.</p>\n"
}